import React, { useEffect, useState } from 'react'
import { useLocation, useNavigate } from 'react-router-dom'
import './Details.css'

export default function MainDetails() {
  useEffect(() => {
    window.scrollTo(0, 0)
  }, [])

  const [maind, setmaind] = useState(
    {
      disease_id: 2,
      disease_img:require('../../../assets/WhatsApp Image 2023-05-30 at 22.21.38.jpg'),
      disease_name: "الأضطراب الغذائي",
      disease_description:`
      الاضطراب الغذائي هو حالة نفسية تؤثر على سلوك الأفراد في تناول الطعام والشعور بالرضا عن جسمهم. يشمل الاضطراب الغذائي مجموعة متنوعة من الأمراض المرتبطة بالتغذية، مثل اضطرابات الأكل، والوذمة، والسمنة المفرطة، والنحافة المفرطة. 
      ويعتبر اضطراب الأكل هو أحد أنواع الاضطراب الغذائي الأكثر شيوعًا، حيث يتميز بسلوك غير طبيعي تجاه تناول الطعام، مثل تناول الطعام الكثير أو القليل جدًا في فترات زمنية محدودة، وهذا يؤدي إلى تأثير سلبي على صحة الفرد وحياته الاجتماعية والنفسية.

      `,
      disease_detrmination:`
      ويعتبر العلاج النفسي هو الخيار الأساسي لمعالجة الاضطرابات الغذائية، ويشمل العلاج التحليلي السلوكي والعلاج الدوائي في بعض الأحيان. كما يمكن للأفراد الذين يعانون من الاضطرابات الغذائية أن يستفيدوا من الدعم المجتمعي ودعم الأصدقاء والعائلة.
      `
    },
  );

  const [diseaseArr, setdiseaseArr] = useState([
    {
      disease_id: 1,
      disease_name: `اضطراب فرط الأكل النفسي | Binge Eating Disorder`,
      disease_nameAr:`اضطراب فرط الأكل النفسي`,
      
      disease_img:require('../../../assets/disease/Avoidan-trestrictive-food-intake-disorder.jpg'),
      disease_youtube:"https://www.youtube.com/embed/W1t5Uz3aCqQ",
      disease_description:
        `
        اضطراب نهم الطعام هو اضطراب قهري يتضمن نوبات متكررة من الشره وتناول كميات كبيرة من الطعام خلال فترة قصيرة. يعد اضطراب نهم الطعام اضطراباً شائعاً وحاداً قد يهدد حياة المصاب. لا يملك المصاب باضطراب النهم السيطرة على نفسه أثناء هذه النوبات، ويرافقه شعور بالخزي والذنب. يتم تشخيص اضطراب نهم الطعام عادةً في سن المراهقة وأوائل العشرينات، إلا أنه يمكن الإصابة به في أي عمر. يمكن أن يصنف اضطراب نهم الطعام حسب حدته إلى:
اضطراب طفيف، وتحدث فيه نوبات نهم الطعام مرة إلى ثلاث مرات أسبوعياً.
اضطراب متوسط، تتكرر فيه هذه النوبات ثمانية إلى ثلاثة عشر مرة.
اضطراب حاد، يصل فيه عدد نوبات النهم لأكثر من أربعة عشر مرة أسبوعياً.
        .`,
     
     
        disease_causes:`

        لا يوجد حتى الآن أسباب معروفة لاضطراب نهم الطعام، إلا أنه هناك بعض العوامل التي تزيد من احتمالية إصابة الشخص بهذا الاضطراب:

        الجنس، حيث أن اضطراب نهم الطعام أكثر شيوعاً لدى الإناث من الذكور.
        السمنة.
        وجود تاريخ عائلي للإصابة باضطراب نهم الطعام أو إدمان الكحول والمواد المخدرة.
        تلقي انتقادات مستمرة حول الوزن، أو الشعور بضغط للظهور بمظهر رشيق
        التعرض للتحرش الجنسي.
        انعدام الثقة بالنفس، أو القلق والتوتر النفسي المستمر.
        قد يلجأ البعض إلى تناول الطعام بنهم كطريقة للتعامل مع المشاكل النفسية أو العاطفية، وقد يرافق هذا الاضطراب الاكتئاب السريري. قد يرافق اضطراب نهم الطعام كذلك إدمان الكحول أو المخدرات
      `,

      description_Sy:`
      إذا كنت مصاباً باضطراب نهم الطعام يمكنك ملاحظة التغييرات التالية على سلوكك عند تناول الطعام:
      `,

      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        تناول كميات كبيرة وغير طبيعية من الطعام في فترات زمنية قصيرة وغير معتادة.
        `
    },
        {
        symptoms_disease:`
        الشعور بفقدان السيطرة على الذات وعدم القدرة على التحكم بكمية الطعام التي يتم تناولها.
        `
    },
        {
        symptoms_disease:`
        التخطيط لممارسة نهم الطعام بشراء كميات كبيرة من الأطعمة.
        `
    },
        {
        symptoms_disease:`
        عدم التوقف عن تناول الطعام حتى عند الشبع والامتلاء.
        `
    },
        {
        symptoms_disease:`
        الأكل بشكل أسرع من المعتاد.
        `
    },
        {
        symptoms_disease:`
        صعوبة التركيز.
        `
    },
        {
        symptoms_disease:`
        اضطرابات في الجهاز الهضمي مثل الإمساك، الحموضة، والمغص.
        `
    },
        {
        symptoms_disease:`
        ضعف الثقة بالنفس.
        `
    },
        {
        symptoms_disease:`
        الشعور بالذنب والخجل من الذات بسبب كمية الطعام التي يتم تناولها.
        `
    },
       

]
,
      




      disease_diagnosis:`


      للمساعدة في تشخيص اضطراب نهم الطعام، سيقوم الطبيب بالسؤال عن العادات الغذائية مثل كمية وسرعة الأكل، وشعور الشخص حول هذه العادات. يشخص اضطراب نهم الطعام عند حدوث نوبات متكررة من النهم تحدث مرة في الأسبوع على الأقل لمدة ثلاث أشهر أو أكثر وتمتاز بالتالي:

      تناول كميات كبيرة من الطعام بفترات زمنية قصيرة، وبسرعة أكبر من المعتاد.
      فقدان السيطرة على الذات، وعدم القدرة على التوقف عن الأكل.
      متابعة الأكل حتى بعد الامتلاء والشعور بالإعياء.
      أكل كميات كبيرة من الطعام، بغض النظر عن الشعور بالجوع.
      تناول الطعام وحيداً خجلاً من كميات الطعام الذي يتناولها.
      الشعور بالخزي والذنب بسبب نهم الطعام.
      * احرص على الصراحة مع طبيبك عند الحديث عن عاداتك الغذائية للمساعدة على تشخيص الاضطراب وتقديم الرعاية الصحية المناسبة.
`,
      disease_treatment:`

      عند الإصابة باضطراب نهم الطعام، لا يستطيع المريض السيطرة على عادات الأكل القهري لديه، ولذلك لا يتعلق العلاج بإرادة المريض أو قدرته على التوقف. يوجد عدة خيارات علاجية لمريض اضطراب نهم الطعام مثل:

      الاستعانة بمعالج أو طبيب نفسي.
      بعض الأدوية التي تعمل على تثبيط الشهية أو الأدوية المضادة للاكتئاب.
      التعامل مع مسببات القلق والتوتر النفسي بالاسترخاء وممارسة اليوغا أو المساج.
      الاستعانة بأخصائي التغذية لتصميم حمية غذائية صحية تساعد على فقدان الوزن المكتسب.
      تجنُّب اتباع حمية ذاتية لخسارة الوزن أثناء تلقي العلاج.
      جلسات العلاج السلوكي المعرفي. 
      `,


      complications_of_the_disease:`


      يؤثر اضطراب نهم الطعام على عدة عمليات حيوية مما ينتج عنه مضاعفات أهمها:

      البدانة، حيث يقدر أن حوالي ثلثي من يشخصون باضطراب نهم الطعام مصابون بالبدانة.
      وصمة العار المرافقة للبدانة.
      تأرجح الوزن صعوداً وهبوطاً، بما يعرف بحمية "اليويو".
      الإصابة بأمراض ناتجة عن البدانة والنظام الغذائي غير الصحي، مثل أمراض القلب، والأوعية الدموية، وارتفاع مستوى الدهون.
      عدم انتظام في الدورة الشهرية لدى النساء.
      الإصابة باضطرابات الجهاز الهضمي.

      `,

      Medications_related_to_the_disease:
     `
      ليسديكسامفيتامين
      `,

      Sources_and_references:[
        
        {
        name:`
        Smitha Bhandari. Binge eating disorder. Retrieved on the 28th of February, 2019, from:
        `,
        links:`
        https://www.webmd.com/mental-health/eating-disorders/binge-eating-disorder/binge-eating-disorder-medref#3
        `,

      },
        {
        name:`
        NationalEatingDisorders. Binge eating disorder. Retrieved on the 28th of February, 2019, from:
        `,
        links:`
        https://www.nationaleatingdisorders.org/learn/by-eating-disorder/bed
        `,

      },
        {
        name:`
MAYOCLINIC            `,
        links:`
        https://www.mayoclinic.org/ar/healthy-lifestyle/weight-loss/in-depth/weight-loss/art-20047342#:~:text=%D8%A7%D9%84%D8%A3%D9%83%D9%84%20%D8%A7%D9%84%D8%B9%D8%A7%D8%B7%D9%81%D9%8A%20%D9%87%D9%88%20%D8%AA%D9%86%D8%A7%D9%88%D9%84%20%D8%A7%D9%84%D8%A3%D9%83%D9%84,%D9%88%D8%AA%D8%B9%D8%B7%D9%8A%D9%84%20%D8%AC%D9%87%D9%88%D8%AF%D9%83%20%D9%81%D9%8A%20%D8%A5%D9%86%D9%82%D8%A7%D8%B5%20%D8%A7%D9%84%D9%88%D8%B2%D9%86.            `,

      },
    
    
    ]

    ,Doctors:[
      {
          Name:`الدكتورة هبه سامي`,
          Address:`الجيزه, مصر`,
          img:require('../../../assets/Doc/doctor-male.jpg'),
          Phone:`01030663633`,
          
      },
      {
          Name:`الدكتور محمد ابوالسعود`,
          Address:`الدقهلية , مصر`,
          img:require('../../../assets/Doc/doctor-male.jpg'),
          Phone:`01008394484`,
          
      }
    ]

    },
    {
      disease_id: 2,
      disease_name: `التقيؤ الذاتي المستمر | Bulimia Nervosa`,
      disease_nameAr:`التقيؤ الذاتي المستمر`,
      
      disease_img:require('../../../assets/disease/tbl_articles_article_30764_64483dac9d3-99bc-4e16-8ea7-d3ad69dc7c14.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/hk0moXO7W74
      `,
      disease_description:
        `
        التَّقيُّؤ هو تقلُّصٌ عنيفٌ في المعدة التي تدفع محتوياتها نحو الأعلى باتجاه المريء وإلى الخارج عن طريق الفم.(انظر أيضًا القيء عند الرُّضَّع والأطفال).يعمل التَّقيُّؤ على إفراغ المعدة وغالبًا ما يُحسِّن شعور الأشخاص المُصابين بالغثيان مؤقَّتًا على الأقل.يكون التَّقيُّؤ مزعجًا وقد يكون عنيفًا.يمكن للقيء الشديد أن يقذفَ بمحتويات المعدة إلى عدَّة أقدام (قَيءٌ قَذفِيّ)يختلف التَّقيُّؤ عن الارتجاع والذي هو قلس محتويات المعدة دون وجود تقلُّصات عنيفة في البطن أو غثيان.فمثلًا، قد يقوم الأشخاص المصابون بتعذر الارتخاء المريئي أو برَتج زينكر باستفراغ الطعام غير المهضوم دون الشعور بالغثيان.
        .
        يرتجع القَيء ( المادَّة المَقِيئَة)-المواد التي يجري تقيُّؤها- الطَّعام المُتناوَل حديثًا عادةً.وهو يحتوي على قطعٍٍ من الطَّعام في بعض الأحيان.تكون المادَّة المَقيئة حمراء عادةً عند تقيُّؤ الدَّم (قيء الدَّم)، ولكن إذا جرى هضم الدَّم جزئيًّا، فإنَّ المادَّة المَقيئة تبدو شبيهة بحُبيبات القهوة.ويؤدِّي وجود الصَّفراء في المادة المَقيئة إلى جعلها مرَّة المذاق وذات لون أصفر مُخضر.
        `,
     
     
        disease_causes:`
        الأَسبَاب الأكثر شُيُوعًا للغثيان والقيء هي:

        التهاب المعدة والأمعاء (عدوى السَّبيل الهضمي)
        الأدوية
        السُّموم
        يحدث الغثيان والقيء نتيجةً لوجود أيِّ خللٍ في السَّبيل الهضمي ولكنَّهما شائعان بشكلٍ خاص عند حدوث التهاب المعدة والأمعاء عادةً.ويُعدُّ انسداد الأمعاء من أقلّ اضطرابات الأمعاء شيوعًا، ذلك أنَّه يُسبِّب التقيؤ نتيجة رجوع الطعام والسوائل إلى المعدة بسبب الانسداد.كما تُسبِّبُ الكثير من اضطرابات البطن الأخرى التي تؤدي إلى التقيؤ ألمًا شديدًا في البطن.وعند حدوث مثل هذه الاضطرابات (مثل، التهاب الزائدة أو التهاب البنكرياس)، يطلب الأشخاص الرعاية الطبيَّة بسبب شعورهم بالألم عادةً وليس بسبب القيء.
        
        ويمكن للكثير من الأدوية، بما فيها الكحول والمُسكِّنات الأفيونية (مثل المورفين) ، الحشيش (الماريجوانا) ،وأدوية المُعالجة الكِيميائيَّة أن تُسبِّبَ الغثيان والقيء.كما يمكن للسموم، مثل الرصاص أو تلك الموجودة في بعض الأطعمة والنباتات أن تُسبِّبَ شعورًا بالغثيان الشديد وحدوث قيء.
        
        الأَسبَاب الأقلُّ شيوعًا
        تشتمل الأَسبَاب الأقل شُيُوعًا لحدوث الغثيان والقيء على ما يلي:
        
        اضطرابات في الدِّماغ أو الجهاز العصبي المركزي
        دُوار الحركة
        التغيُّرات الاستقلابية أو مرض في كامل الجسم (مجموعي)
        الاضطرابات النَّفسيَّة
        مُتلازمة القيء الدَّوري
        كما يمكن أن يتنبَّه مركز القيء من خلال اضطراباتٍ مُعيَّنة في الدِّماغ أو في الجهاز العصبي المركزي، بما فيها حالات العدوى (مثل التهاب السحايا و التهاب الدِّماغ) و الشَّقيقة والاضطرابات التي تزيدُ الضغط داخل الجمجمة (الضغط داخل القحف).وتنطوي الاضطرابات التي تزيد الضَّغط داخل القحف على أورام الدِّماغ و نزف الدِّماغ و إصابات الرَّأس الشَّديدة.
        
        يوجد اتِّصالٌ بين أعضاء التوازن في الأذن الداخلية (الجِّهاز الدِّهليزي) و مركز القيء.ويُعدُّ هذا الاتصال سبب شعور بعض الأشخاص بالغثيان من حركة القارب أو السيَّارة أو الطائرة ومن اضطراباتٍ معيَّنة في الأذن الداخلية (مثل التهاب التيه و دُوار الوضعيَّة).
        
        كما قد يحدث الغثيان والقيء عند وجود تغيُّرات استقلابيَّة في الجسم، كما هي الحال في المراحل المُبكِّرة من الحمل أو عند وجود إصابة شديدة بداء السُّكَّري تعذّر ضبطها أو الإصابة بفشل شديد في الكبد أو في الكلية الكلى.
        
        تُعدُّ متلازمة الغثيان والقيء المزمنان أحد الاضطرابات الوظيفيَّة.أي أنَّ الغثيان والقيء لا ينجمان عن اضطراب نفسي فيزيائي أو نوعي، ولكنهما قد يكونان مشكلة في طريقة تواصل الدماغ مع الجهاز الهضمي.يُعاني الأشخاص المصابين بهذه المُتلازمة من إزعاج الغثيان أو القيء أو من كليهما والذي يحدث مرة واحدة على الأقل في الأسبوع لمدة 6 أشهر على الأقل، بما في ذلك الأشهر الثلاثة الأخيرة، والذي ليس له سببٌ محدَّدٌ بعد إجراء الاختبارات.
        
        كما يمكن للمشاكل النَّفسيَّة أن تُسبِّب شعورًا بالغثيان والقيء.قد يكون هذا التقيُّؤ مُتعمَّدًا.فمثلًا، قد يقوم الأشخاص المصابون بالنُّهام العصبي بافتعال التقيُّؤ لإنقاص وزنهم.أو قد يكون غيرَ مُتعمَّدٍ.مثل، تقيُّؤ الأطفال الذين يخشون الذهاب إلى المدرسة وذلك كردَّة فعلٍ على الشِّدَّة النفسيَّة.
        
        تُعدُّ مُتلازمة القيء الدَّوري من الاضطرابات غير الشائعة التي يُعاني فيها الأشخاص من هجماتٍ شديدةٍ من القيء (أو من الغثيان فقط في بعض الأحيان) بفواصل زمنيَّة متفاوتة.يكون شعور الأشخاص طبيعيَّا خلال الفترات الفاصلة بين الهجمات.تستمرُّ هذه المُتلازمة حتَّى سن البلوغ في بعض الأحيان، رغم أنَّها تبدأ خلال مرحلة الطفولة عادةً.ينجم القيء الدَّوري الذي يبدأ في مرحلة البلوغ غالبًا عن الاستعمال المزمن للماريجوانا.يمكن تخفيف شدَّة القيء من خلال الاستحمام بالماء الساخن ويزول بعد توقف الأشخاص عن تعاطي الماريجوانا.
        
        
                 `,
                 description_Sy:`
                 تكون بعض الأَعرَاض والملامح مدعاةً للقلق.وهي تشتمل على ما يلي:
                 `,

                 Symptoms_of_the_disease:
                 [
                   {
                   symptoms_disease:`
                   علامات الإصابة بالتَّجفاف (مثل العطش وجفاف الفم وتبوُّل كميَّة قليلة أو عدم التَّبوُّل والشُّعور بالضَّعف والتعب)
                   `
               },
                   {
                   symptoms_disease:`
                   الصُّداع أو تيبُّس الرقبة أو التَّخليط الذهنِي أو انخفاض مستوى اليَقَظة
                   `
               },
                   {
                   symptoms_disease:`
                   ألَم البَطن المستمر
                   `
               },
                   {
                   symptoms_disease:`
                   الشُّعور بالإيلام عندما لمس البطن
                   `
               },
                   {
                   symptoms_disease:`
                   تمدُّد (تورُّم) البطن
                   `
               },
                  
           
           ]
     ,

      disease_diagnosis:`
      يستفسر الأطبَّاء في البداية عن أعراض المريض وعن تاريخه الصِّحي.ثم يقوم الطبيب بإجراء الفحص السريري.تُشير المعلومات التي يحصل عليها الأطبَّاء من معرفة التاريخ الصحي ومن الفحص السَّريري غالبًا إلى سبب حدوث القيء والاختبارات التي قد يكون من الضَّروري إجراؤها. ( انظر جدول: بعض أسباب وملامح الغثيان والقيء).

      يسأل الأطباء خلال استفسارهم عن التَّاريخ الصحي عمَّا إذا كان الشخص حاملًا (للمرأة) أو مصابًا بداء السُّكري أو بالشقيقة أو بمرضٍ كبديٍّ أو كلويٍّ أو بالسَّرطان (بما فيها توقيت أيِّ علاج كيميائي أو شعاعي).وينبغي تسجيل جميع الأدوية والمواد المُستَعملة حديثًا وذلك لأنَّه قد لا تظهر سُميَّة بعض المواد إلَّا بعد مرور عدَّة أيَّام على استعمالها (مثل الأسيتامينوفين وبعض أنواع الفطور).
      
      يتحرَّى الأطبَّاء خلال الفَحص السَّريري عمَّا يلي:
      
      علامات الإصابة بالتَّجفاف (مثل تسرُّع معدَّل ضربات القلب وانخفاض ضغط الدَّم وجفاف الفم)
      علامات اضطراب خطير في البطن (مثل انتفاخ البطن أو الشُّعور بإيلام شديد عند اللَّمس)
      انخفاض مستوى اليقظة أو أيِّ تشوُّهات عصبيَّة أخرى تُشير إلى وجود اضطراب دماغي
      ملاحظة الأطبَّاء لأيِّ عمليَّة جراحيَّة سابقة في البطن وذلك لاحتمال تشكُّل حزم ليفيَّة من النَّسيج المُتندِّب (التصاقات) والتي تتسبَّب في حدوث انسداد مِعَوي.
      
      ورغم أنَّ الأشخاص الذين يُعانون من اضطراباتٍ سابقة معروفة مُسبِّبة لحدوث القيء (مثل الشقيقة) يمكن أن يتجدَّد حدوثها، إلَّا أنَّ الأطبَّاء يتحرُّون عن علاماتٍ لمشكلةٍ جديدةٍ مختلفة.
      
      
      `

,
      disease_treatment:`

      تجري معالجة حالات مُعيَّنة.يمكن عند عدم وجود اضطرابٍ كامن خطيرٍ وعدم إصابة الشخص بالتَّجفاف، تناول كميات صغيرة من السوائل الصافية بعد 30 دقيقة تقريبًا من انتهاء نوبة القيء.تبدأ المعالجة بإعطاء 1 أونصة (30 أو 60 مل) أو أونصتين عادةً.الماء العادي هو السَّائِل المناسب، ولكن يمكن تناول المَرَق أو الشاي الخفيف المُحلَّى.لا توجد ميِّزةٌ خاصَّة للمشروبات الرياضية، ولكنَّ تناولها ليسَ ضارًّا.إذا تحمَّل الشخص تناولَ هذه السوائل، فتجري زيادة كميَّاتها تدريجيًّا.وإذا تحمَّل الشخص هذه الزيادات، فقد يستأنف الشخص تناول الطعام بالشَّكل الطبيعي.وينبغي تجنُّب تناول المشروبات الغازية والكحول.

      يوصي الأطبَّاء عادةً بشرب محاليل الإماهة الفمويَّة طالما استطاع الأشخاص تحمُّل بعض السوائل عن طريق الفم حتى عند معاناة الأشخاص من تجفافٍ بسيط.يحتاج الأشخاص الذين يعانون من التَّجفاف الشديد أو من خللٍ في مستويات كهارل الدَّم أو من قيءٍ مستمر، والأشخاص الذين لا يمكنهم شرب أيِّ سوائل عن طريق الفم عادةً إلى تقديم السوائل أو الأدوية عن طريق الوريد (وريديًّا).
      `,


      complications_of_the_disease:`


      يمكن أن يُؤدِّي التَّقيُّؤ إلى حدوث مضاعفاتٍ بالإضافةً إلى الإزعاج الذي يُسبِّبه، فقد يحدث:

      استنشاق المادَّة المَقيئة (الشفط)
      تمزُّق المريء (تمزُّق مالوري-وايس، متلازمة بويرهاف)
      التَّجفاف وخلل في نِسَب الكهارل
      نقص التَّغذية ونَقص الوَزن
      يمكن أن يقومَ الأشخاص الفاقدين لوعيهم كليًّا أو جزئيًّا باستنشاق المادَّة المَقيئة.قد يؤدي وجود الحمض في القيء إلى حدوث تهيُّج شديد في الرئتين.
      
      يزيد التّقيُّؤ بشكلٍ كبيرٍ من الضَّغط داخل المريء، وقد يؤدي التقيُّؤ الشديد إلى تمزُّق بطانة المريء (انظر الإصابة في المريء).يؤدي حدوث تمزُّق صغير إلى الشُّعور بالألم وحدوث نزف في بعض الأحيان، إلَّا أنَّ حدوث نزفٍ كبيرٍ قد يكون مُميتًا.
      
      ونتيجةً لفقد الأشخاص للماء والمعادن (الكهارل) من خلال القيء، فقد يُسبِّب التَّقيُّؤ الشديد حدوث تجفافٍ و خللٍ في مستويات الكهارل.يكون حديثو الولادة والرُّضَّع أكثرَ عُرضةً بشكلٍ خاص لظهور هذه المُضَاعَفات.
      
      يمكن أن يؤدي القيء المزمن إلى حدوث نقصٍ في التَّغذية والوَزن وشذوذٍ استقلابيٍّ.

      `,

      Medications_related_to_the_disease:
     `
     بروكلوربيرازين , برومثازين , ميتوكلوبراميد
      `,

      Sources_and_references:[
        
        {
        name:`
        أدلةMSD
        `,
        links:`
        https://www.msdmanuals.com/ar/home/%D8%A7%D9%84%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A%D9%91%D9%8E%D8%A9/%D8%A3%D8%B9%D8%B1%D8%A7%D8%B6-%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D8%AC%D9%87%D8%A7%D8%B2-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A/%D8%A7%D9%84%D8%BA%D8%AB%D9%8A%D8%A7%D9%86-%D9%88%D8%A7%D9%84%D9%82%D9%8A%D8%A1-%D8%B9%D9%86%D8%AF-%D8%A7%D9%84%D8%A8%D8%A7%D9%84%D8%BA%D9%8A%D9%86#:~:text=%D8%AA%D9%8F%D8%B9%D8%AF%D9%8F%D9%91%20%D9%85%D9%8F%D8%AA%D9%84%D8%A7%D8%B2%D9%85%D8%A9%20%D8%A7%D9%84%D9%82%D9%8A%D8%A1%20%D8%A7%D9%84%D8%AF%D9%8E%D9%91%D9%88%D8%B1%D9%8A%20%D9%85%D9%86,%D8%AE%D9%84%D8%A7%D9%84%20%D8%A7%D9%84%D9%81%D8%AA%D8%B1%D8%A7%D8%AA%20%D8%A7%D9%84%D9%81%D8%A7%D8%B5%D9%84%D8%A9%20%D8%A8%D9%8A%D9%86%20%D8%A7%D9%84%D9%87%D8%AC%D9%85%D8%A7%D8%AA.            `,

      },
     
    
    
    ]

    ,Doctors:[
      {
          Name:`الدكتورة رشا حسين طنطاوي`,
          Address:`القاهرة , مصر`,
          img:require('../../../assets/Doc/Rasha Hussein.jpg'),
          Phone:`01152484999`,
          
          
      },
      {
          Name:`الدكتورة ساميه بباوي`,
          Address:`الجيزه , مصر`,
          img:require('../../../assets/Doc/doctor-male.jpg'),
          Phone:`01222740669`,
          
      }
    ]

    },
    {
      disease_id: 3,
      disease_name: `
      
      فقدان الشهية العصبي | Anorexia Nervosa
      `,
      disease_nameAr:`فقدان الشهية العصبي`,
      
      disease_img:require('../../../assets/disease/2020_12_15_13_21_19_716.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/Y6aXD7XcSN8          `,
      disease_description:
        `
        فقدان الشهية العصبي (بالإنجليزية: Anorexia Nervosa)، هو أحد أنواع اضطرابات الأكل التي تنطوي على الخوف الشديد من اكتساب الوزن، أو عدم الرضا عن صورة الجسم وشعور الشخص بالسمنة على الرغم من كونه نحيف.

        يعرف فقدان الشهية العصبي أيضاً باسم القهم العصبي أو فقدان الشهية العصابي، ويعتبر من الاضطرابات النفسية الخطيرة التي تؤثر على الصحة العقلية والجسدية، وقد تشكل خطراً على حياة المريض، إذ يمكن أن يؤدي الخوف المبالغ من اكتساب الوزن إلى التوقف عن تناول الطعام أو ممارسة التمارين الرياضية بشكل مفرط بهدف إنقاص الوزن أكثر.
        
        في معظم الحالات، يعاني الأشخاص المصابون بفقدان الشهية العصبي من انخفاض شديد في وزن الجسم. ولكن هناك حالات توصف بفقدان الشهية العصبي غير النمطي، والتي يفقد المصابون به الكثير من الوزن ويظهر عليهم العديد من ممارسات فقدان الشهية العصبي، إلا أنهم لا يعانون من انخفاض شديد في الوزن أو في مؤشر كتلة الجسم.
        
        يمكن أن يصيب مرض فقدان الشهية العصبي النساء والرجال من مختلف الأعمار، إلا أنه أكثر شيوعاً لدى المراهقات، وغالباً ما تبدأ أعراضه بالظهور في منتصف مرحلة المراهقة أو بداية البلوغ. ولكن من الممكن أيضاً أن تبدأ أعراضه في سن ما قبل المراهقة أو في وقت لاحق من العمر.
        
        .`,
     
     
        disease_causes:`

        تعد أسباب فقدان الشهية العصبي غير محددة بشكل حاسم، ولكن يمكن أن تكون الأسباب مزيج ما بين بعض العوامل الجينية، والبيئية، والنفسية، ومنها:

        التغيرات الهرمونية، وخاصة خلال فترة البلوغ.
        امتلاك صورة سلبية عن الجسم، أو التعرض لانتقادات حول وزن وشكل الجسم.
        امتلاك شخصية تميل إلى الهوس في الكمال أو المثالية.
        التأثر بالضغط المجتمعي فيما يخص بالمظهر النحيف، وربط صورة الجسم النحيل بالجمال من خلال وسائل الإعلام، مثل المجلات والتلفزيون.
        الإصابة باضطراب الوسواس القهري، حيث يمكن أن يكون مريض الوسواس القهري أكثر استعداداَ للحفاظ على نظام غذائي ورياضي صارم مشابه لما يمارسه مريض فقدان الشهية العصبي.
        الإصابة ببعض الاضطرابات النفسي، مثل القلق، وعدم الثقة بالنفس.
        عوامل خطر الإصابة بفقدان الشهية العصبي
        هناك عدة عوامل التي تجعل بعض الأفراد أكثر عرضةً للإصابة باضطراب القهم العصابي، وتشمل:
        
        العوامل الجينية والوراثية.
        وجود تاريخ عائلي للإصابة بأمراض السمنة أو اضطرابات الأكل، أو الإصابة بالاكتئاب والاضطرابات النفسية الأخرى.
        الإصابة بمرض السكري من النوع الأول.
        العمل في مجالات تتطلب رشاقة الجسم أو النحافة، مثل عرض الأزياء
        
      
        `,
        
        description_Sy:`
        
        
        تختلف أعراض فقدان الشهية العصبي بين الأشخاص، حيث لا يؤثر هذا الاضطراب على جميع المرضى بنمط واحد. ويمكن تصنيف الأعراض إلى أعراض بدنية وأعراض سلوكية وعاطفية.
        اعراض فقدان الشهية العصبي البدنية
        تشمل أعراض فقدان الشهية العصبية الجسدية ما يلي:
     
        
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        فقدان الكثير من الوزن والمظهر النحيل للجسم.
        `
    },
        {
        symptoms_disease:`
        رائحة الفم الكريهة.
        `
    },
        {
        symptoms_disease:`
        هشاشة الأظافر.
        `
    },
        {
        symptoms_disease:`
        انخفاض ضغط الدم.
        `
    },
        {
        symptoms_disease:`
        انخفاض درجة حرارة الجسم، والشعور ببرودة في الأطراف.
        `
    },
        {
        symptoms_disease:`
        فقدان كثافة العظام، مما يزيد من خطر الإصابة بالكسور.
        `
    },
        {
        symptoms_disease:`
        الإمساك.
        `
    },
        {
        symptoms_disease:`
        مشاكل في الحمل أو الإصابة بالعقم.
        `
    },
        {
        symptoms_disease:`
        تسوس الأسنان، وخاصة لدى المرضى الذين يمارسون التقيؤ المتعمد.
        `
    },
        {
        symptoms_disease:`
        الأرق.
        `
    },
        {
        symptoms_disease:`
        تساقط الشعر.
        `
    },
        {
        symptoms_disease:`
        جفاف الجلد.
        `
    },
        {
        symptoms_disease:`
        الدوار أو الدوخة.
        `
    },
        {
        symptoms_disease:`
        الشعور بالخمول أو التعب والإرهاق.
        `
    },
        {
        symptoms_disease:`
        فقدان الكثير من الوزن والمظهر النحيل للجسم.
        `
    },
        {
        symptoms_disease:`
        خسارة شديدة في كتلة العضلات.
        `
    },

]
    ,

      disease_diagnosis:`

      يعتمد تشخيص فقدان الشهية العصبي على القيام بعض الفحوصات، وتشمل:

      قياس الطول والوزن.
      التحقق من العوامل والعلامات الحيوية، بما في ذلك ضغط الدم، ونبض القلب، ودرجة الحرارة.
      القيام ببعض الفحوصات المخبرية، مثل:
      فحص تعداد خلايا الدم الكامل.
      فحص كهارل الدم.
      فحص البروتينات.
      فحص وظائف الكبد
      فحص وظائف الكلى.
      فحص وظائف الغدة الدرقية.
      تساعد الفحصوات المخبرية على تحديد والكشف عن وجود أسباب ومشاكل صحية أخرى قد تسبب فقدان الشهية، وفقدان الوزن والجسم النحيل، مثل السرطان، ومرض السكري، وسوء امتصاص الغذاء من الأمعاء، وفرط نشاط الغدة الدرقية.
      
      كما يتم إجراء التقييم النفسي والعاطفي لدى المريض، لتشخيص الإصابة بفقدان الشهية العصبي وللكشف عن وجود اضطرابات نفسية أخرى. والجدير بالذكر أنه تتوافر عدد من المعايير التشخيصية لفقدان الشهية العصبي، ومنها:
      
      رفض الحفاظ على الوزن بشكل مقارب أو أكثر من الحد الأدنى المناسب للعمر والطول.
      الخوف الشديد من اكتساب الوزن او السمنة بالرغم من نقص الوزن عن الحد الطبيعي.
      إنكار خطورة نقص الوزن وامتلاك صورة خاطئة عن المظهر الخارجي للجسم.
      غياب دروة الحيض لثلاث دورات متتالية.
      الهوس باتباع الحميات الغذائية.
      ممارسة تمارين رياضية شديدة وعنيفة بهدف إنقاص الوزن.
      

      `,
      disease_treatment:`

      يعتمد علاج فقدان الشهية العصبي على عدد من التدابير التي تهدف الى استعادة الوزن الطبيعي للجسم وضبط سلوكيات تناول الطعام، ومنها:

      زيادة النشاط الاجتماعي.
      العلاج النفسي لفقدان الشهية العصبي، لتطوير استراتيجيات سلوكية لاستعادة الوزن الصحي للمصاب، ومساعدة الشخص على استعادة ثقته بنفسه وشكل جسمه.
      اتباع نظام غذائي صحي مناسب لاحتياجاته لتعويض اي نقص في العناصر المهمة للجسم.
      العلاج بالأدوية المضادة للاكتئاب أو القلق أو اضطراب الوسواس القهري المرافقين للإصابة بفقدان الشهية العصبي.
      قد يشمل علاج فقدان الشهية العصبي إدخال المريض للمستشفى، خاصة في الحالات الشديدة، وذلك من أجل تغذية المريض عن طريق الأنابيب الأنفية المعدية أو عبر الوريد.
      
      
      `,


      complications_of_the_disease:`

      يمكن أن يسبب إهمال علاج فقدان الشهية العصبي أو التأخر في بدء العلاج إلى مشاكل صحية ومضاعفات عديدة، مثل:

      هشاشة العظام.
      الجفاف المزمن.
      سوء التغذية.
      تسوس الأسنان.
      اضطرابات الغدة الدرقية.
      انخفاض بوتاسيوم الدم والتأثير على نظم القلب.
      تلف في عضلة القلب.
      انخفاض مناعة الجسم، وانخفاض عدد خلايا الدم البيضاء، وزيادة فرصة الإصابة بالعدوى.
      فقر الدم.
      اضطرابات في الجهاز الهضمي.
      مشاكل الخصوبة وفقدان الدافع الجنسي.
      اضطرابات في الكلى.
      مشاكل في الدماغ والأعصاب، بما في ذلك حدوث النوبات، وصعوبة التركيز، وفقدان الذاكرة.
      في الحالات الشديدة، يمكن أن يؤدي اضطراب فقد الشهية العصابي إلى الموت في حال تأخر التشخيص وتلقي العلاج
      `,

      Medications_related_to_the_disease:
     `
     كيوي، شمرة شائعة، بابونج ألماني، نعناع فليفلي، فطريات الخميرة، الزنجبيل
     فلافونيدات، نبات خبز النحل، جينسنغ، غذاء ملكات النحل، فطريات الخميرة، زيت جنين القمح
     فيتامين ب3، فيتامين ب6، فيتامين ب2، فيتامين ب 1
     مستخلص الجنطيانا، مستخلص زيت الحمضيات، مستخلص زيت النعناع
               `,

      Sources_and_references:[
        
        {
        name:`
        National Health Service (NHS). Overview - Anorexia. Retrieved on the 16th of December, 2021.


        `,
        links:`
        https://www.nhs.uk/mental-health/conditions/anorexia/overview/            `,

      },
        {
        name:`
         Shaziya Allarakha. What's the Difference Between Anorexia and Anorexia Nervosa? Retrieved on the 16th of December, 2021.
        `,
        links:`
        https://www.medicinenet.com/anorexia_nervosa/article.htm            `,

      },
        
    ]

    ,Doctors:[
      {
          Name:`الدكتور هشام الوكيل`,
          Address:`الجيزة , مصر`,
          img:require('../../../assets/Doc/75c784cdb9f10a6a866d0fddfa5271de.jpg'),
          Phone:`0020233360311`,
          
      },
      {
          Name:`الدكتور سمير كامل`,
          Address:`القاهرة , مصر`,
          img:require('../../../assets/Doc/m_560534.jpg'),
          Phone:`01033061957`,
          
      }
    ]

    },
    {
      disease_id: 4,
      disease_name: `
      
      أضطراب تناول الطعام بشكل محدود |  Avoidant/restrictive food intake disorder
      `,
      disease_nameAr:`أضطراب تناول الطعام بشكل محدود`,
      
      disease_img:require('../../../assets/disease/AVOIDANT-RESTRICTIVE-FOOD-INTAKE.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/i0chDhP4fXc              `,
      disease_description:
        `
        ضطراب مدخُول الطعام الاجتنابيّ/المُقَيَّد avoidant/restrictive food intake disorder هُوَ واحدٌ مِن اضطرابات الأكل يجعل المرضى يتناوَلون كمياتٍ قليلةٍ جدًا من الطعام أو يتجنَّبون أنواعاً مُعيَّنة من الطعامِ.لا يخشى مَرضى هذا الاضطراب من اكتسابِ الوزن،وخلافًا لمرضى فقدان الشهيَّة، لا يعتقد مرضى اضطراب مدخُول الطعام الاجتنابيّ/المُقَيَّد أنَّ لديهم وزنًا زائدًا عِندما يكون العكسُ هُو الصحيح.

        يُؤدِّي هذا الاضطرابُ إلى نقص الوَزن عند البالغين عادةً،
        ويُمكن أن ينجُم عن تجربةٍ سيئةٍ مع الطعام، مثل الشَّرق أو الغصَّة choking
        قد لا ينمُو الأطفالُ والرُّضَّع مثلما هُو مُتوقَّع،
        ويُمكن أن يُؤدِّي هَذا الاضطرابُ إلى مشاكل تغذويَّة تُهدِّد الحياة
        يُواجهُ مَرضى هذا الاضطراب مشاكلَ تتعلّق بالأوضاع الاجتماعيَّة، مثل تناوُل الطعام مع الآخرين أو كونهم في علاقاتٍ.
        
        يبدأ اضطرابُ مَدخُول الطعام الاجتنابيّ/المُقَيَّد في أثناء الطفولة غالبًا،ويمكن أن يبدأ عندَ الأطفال الذين ليس لديهم اهتمام في الطَّعَام أو الذين لا يُحبون الشعور الذين يُسبّبه الطعام في الفم.يختلِفُ هذا الاضطرابُ عن الحَالات العادية من انتقاء الطعام، لأن الأشخاصَ الانتقائيين في الأكل:
        
        يكونون غالبًا انتقائيين فقط بالنسبة إلى عددٍ قليلٍ مِن أنواع الطعام
        يَتناوَلون كميات طبيعية من الطعام بشكلٍ عام
        يبقى النموُّ لديهم كما هُو متوقَّع، ولكن قد لا يَكون هذا الأمر صحيحاً بالنسبة إلى مرضى اضطراب مدخُول الطعام الاجتنابيّ/المُقَيَّد
        .`,
     
     
        disease_causes:`

        تعد أسباب فقدان الشهية العصبي غير محددة بشكل حاسم، ولكن يمكن أن تكون الأسباب مزيج ما بين بعض العوامل الجينية، والبيئية، والنفسية، ومنها:

        التغيرات الهرمونية، وخاصة خلال فترة البلوغ.
        امتلاك صورة سلبية عن الجسم، أو التعرض لانتقادات حول وزن وشكل الجسم.
        امتلاك شخصية تميل إلى الهوس في الكمال أو المثالية.
        التأثر بالضغط المجتمعي فيما يخص بالمظهر النحيف، وربط صورة الجسم النحيل بالجمال من خلال وسائل الإعلام، مثل المجلات والتلفزيون.
        الإصابة باضطراب الوسواس القهري، حيث يمكن أن يكون مريض الوسواس القهري أكثر استعداداَ للحفاظ على نظام غذائي ورياضي صارم مشابه لما يمارسه مريض فقدان الشهية العصبي.
        الإصابة ببعض الاضطرابات النفسي، مثل القلق، وعدم الثقة بالنفس.
        عوامل خطر الإصابة بفقدان الشهية العصبي
        هناك عدة عوامل التي تجعل بعض الأفراد أكثر عرضةً للإصابة باضطراب القهم العصابي، وتشمل:
        
        العوامل الجينية والوراثية.
        وجود تاريخ عائلي للإصابة بأمراض السمنة أو اضطرابات الأكل، أو الإصابة بالاكتئاب والاضطرابات النفسية الأخرى.
        الإصابة بمرض السكري من النوع الأول.
        العمل في مجالات تتطلب رشاقة الجسم أو النحافة، مثل عرض الأزياء
        
      
        `,
        
        description_Sy:`
        
        
        يتناول الأشخاصُ، الذين يعانون من هذا الاضطراب، الطعامَ بكميات قليلة جدًّا أو يتجنَّبون تناول بعض الأطعمة؛ممَّا قد يؤدي إلى فقدانهم الكثيرَ من الوزن نتيجة تقليلهم لكميات الطعام المستهلكة.وقد وُجِد أيضًا أن الأطفالَ الذين يعانون من هذا اضطراب قد يتأثر نموهم عن المتوقَّع.

        كما يصبح من الشائع أن يحصلَ لدى المصابين بهذا الاضطراب نقص غذائي قد يكون مهددًا لحياتهم.
        
        ويمكن أن يجدَ الأشخاص المصابين بهذا الاضطراب صعوبة في المشاركة في الأنشطة الاجتماعية العادية، مثل تناول الطعام مع الآخرين والحفاظ على العلاقات بسبب سلوكهم الغذائي.
        
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        صعوبه تناول الطعام مع الآخرين            `
    },
       

]
    ,

      disease_diagnosis:`

      يتفحَّص الأطباءُ المريض للتأكُّد من أنَّ نقص الوزن لديه لا ينجُم عن مشكلة صحيَّة، مثل الحساسية للطعام أو السرطان أو مشكلة في هضم الطعام.كَما يأخذُ الأطباءُ في اعتبارهم أيضًا المشاكل الأخرى المتعلِّقة بالصحَّة النفسية والتي يُمكن أن تُؤدِّي إلى نَقص الوَزن.

      `,
      disease_treatment:`

      قَد يقترح الأطباءُ علاجًا للتقليل من شُعور المريض بالقلق حولَ ما يأكله،وقد يُعطونه مُكمِّلات غذائية ليأخذها عَن طريق الفم.


      
      `,


      complications_of_the_disease:`

      يعاني الأشخاص المصابون باضطراب تناول الطعام الاجتنابي/ المحدد من عدم تلبية احتياجاتهم الغذائية اليومية؛ مما قد يتسبب في حدوث المضاعفات الآتية: [2]

      جفاف الجلد والشعر والأظافر.
      تغير شعر الجسم ليصبح ناعماً وترقق شعر الرأس.
      ضعف المناعة وتأخر التئام الجروح.
      فقر الدم.
      بطء معدل ضربات القلب.
      مشاكل النوم.
      عدم انتظام الدورة الشهرية.
      دوار أو إغماء.
      قد يرافق اضطراب تجنب الطعام أيضاً انخفاض نسبة الحديد والبوتاسيوم في الدم، وانخفاض مستوى هرمونات الغدة الدرقية، وكذلك نقص تعداد خلايا الدم. [2]
      
      يمكن أن يؤدي اضطراب تناول الطعام الاجتنابي أو المقيد إذا ترك دون علاج إلى سوء تغذية شديد مهدد للحياة.
      
      
      `,

      Medications_related_to_the_disease:
     `
     إعطاء المكملات الغذائية.
`,

Sources_and_references:[
        
{
name:`
أدلةMSD
`,
links:`
https://www.msdmanuals.com/ar/home/%D8%A7%D9%84%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A%D9%91%D9%8E%D8%A9/%D8%A3%D8%B9%D8%B1%D8%A7%D8%B6-%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D8%AC%D9%87%D8%A7%D8%B2-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A/%D8%A7%D9%84%D8%BA%D8%AB%D9%8A%D8%A7%D9%86-%D9%88%D8%A7%D9%84%D9%82%D9%8A%D8%A1-%D8%B9%D9%86%D8%AF-%D8%A7%D9%84%D8%A8%D8%A7%D9%84%D8%BA%D9%8A%D9%86#:~:text=%D8%AA%D9%8F%D8%B9%D8%AF%D9%8F%D9%91%20%D9%85%D9%8F%D8%AA%D9%84%D8%A7%D8%B2%D9%85%D8%A9%20%D8%A7%D9%84%D9%82%D9%8A%D8%A1%20%D8%A7%D9%84%D8%AF%D9%8E%D9%91%D9%88%D8%B1%D9%8A%20%D9%85%D9%86,%D8%AE%D9%84%D8%A7%D9%84%20%D8%A7%D9%84%D9%81%D8%AA%D8%B1%D8%A7%D8%AA%20%D8%A7%D9%84%D9%81%D8%A7%D8%B5%D9%84%D8%A9%20%D8%A8%D9%8A%D9%86%20%D8%A7%D9%84%D9%87%D8%AC%D9%85%D8%A7%D8%AA.            `,

},



]
,Doctors:[
  {
      Name:`الدكتورة اسراء نوح`,
      Address:`القاهرة , مصر`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01222145552`,
      
  },
  {
      Name:`الدكتور محمد كمال`,
      Address:`القاهرة , مصر`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01010322056`,
      
  }
]

    },
    {
      disease_id: 5,
      disease_name: `
      
      أضطراب تناول الطعام علي نحو غير منتظم | Other Specified Feeding and Eating Disorder 
      `,
      disease_nameAr:`أضطراب تناول الطعام علي نحو غير منتظم`,
      
      disease_img:require('../../../assets/disease/اضطرابات-الطعام.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/Y6aXD7XcSN8          `,
      disease_description:
        `
        اضطراب التغذية والأكل المحدد الآخر (OSFED) هو تصنيف لاضطراب الأكل لأولئك الذين لا يستوفون المعايير التشخيصية لأي اضطرابات أكل أخرى. حل OSFED محل عبارة "اضطراب الأكل غير المحدد بطريقة أخرى (EDNOS)" في الدليل التشخيصي والإحصائي (DSM-IV).

        قد يعاني الأفراد المصابون بـ OSFED من عادات غذائية مضطربة ، أو صورة مشوهة للجسم ، أو تقدير مبالغ فيه لشكل الجسم ووزنه ، أو خوفًا شديدًا من زيادة الوزن. OSFED هو اضطراب الأكل الأكثر شيوعًا الذي يتم تشخيصه للبالغين وكذلك المراهقين ويؤثر على الناس من جميع الأجناس.
        `,
     
     
        disease_causes:`
        يعاني حوالي 30٪ من الأشخاص الذين يسعون للعلاج من اضطراب الأكل من اضطرابات أخرى في التغذية أو الأكل (OSFED). تختلف أسباب تطوير OSFED من شخص لآخر ؛ تشمل الأسباب المعروفة الاستعداد الوراثي ومجموعة من العوامل البيئية والاجتماعية والثقافية. يمكن أن يحدث OSFED ، مثل العديد من اضطرابات الأكل الأخرى ، من خلال المشاعر والعواطف الأساسية التي لم يتم حلها. من المعروف أن صدمات الطفولة ، والقلق ، والاكتئاب ، والتنمر ، وتدني احترام الذات ، والشخصية المثالية ، ومهارات العلاقات الشخصية السيئة تساهم في ظهور OSFED.

        بالإضافة إلى ذلك ، إذا كان والدك أو شقيقك يعاني من اضطراب في الأكل ، فمن المرجح أن تصاب بـ OSFED.
      
        `,
        
        description_Sy:`
        
        بشكل عام ، تشير السلوكيات والمواقف إلى أن فقدان الوزن واتباع نظام غذائي والتحكم في الطعام أصبحت من الاهتمامات الأساسية
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        فقدان الوزن بشكل كبير                      `
    },
        {
        symptoms_disease:`
        ينفي الشعور بالجوع                     `
    },
        {
        symptoms_disease:`
الامساك`

},
        {
        symptoms_disease:`
        تخطي وجبات الطعام أو تناول أجزاء صغيرة من الطعام في وجبات الطعام العادية                   `
    },
        {
        symptoms_disease:`
        فقدان الوزن بشكل كبير                      `
    },
       

]
    ,

      disease_diagnosis:`

      قد يتم بعد ذلك تحديد التشخيص الذي يعالج السبب المحدد لعدم تلبية العرض التقديمي لخصائص اضطراب آخر (على سبيل المثال ، الشره المرضي العصبي - التردد المنخفض).    
      `,
      disease_treatment:`

      الخبر السار هو أن التعافي ممكن! علاج OSFED فردي للغاية ، بناءً على التشخيص المحدد ، مع استخدام فريق العلاج لطرق العلاج القائمة على الأدلة مع نجاح مثبت.


      
      `,


      complications_of_the_disease:`

      هناك نقص عام في الفهم فيما يتعلق بخطورة OSFED وأهمية العلاج المهني لأولئك الذين يعانون من الاضطرابات التي تندرج تحت هذه الفئة. من المفاهيم الخاطئة الشائعة حول OSFED أنها ليست شديدة ، ويعتقد البعض أن الأشخاص الذين يعانون من OSFED لا يحتاجون إلى العلاج.

      يمكن أن يؤدي تأخير العلاج إلى تطوير اضطرابات متزامنة أو تفاقم شدة الاضطراب الحالي ، ويحتاج الأشخاص المصابون بـ OSFED إلى العلاج تمامًا مثل أولئك الذين يعانون من أي اضطراب أكل آخر.
      
      `,

      Medications_related_to_the_disease:
     `
     إعطاء المكملات الغذائية.
`,

Sources_and_references:[
        
{
name:`
أدلةMSD
`,
links:`
https://www.msdmanuals.com/ar/home/%D8%A7%D9%84%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A%D9%91%D9%8E%D8%A9/%D8%A3%D8%B9%D8%B1%D8%A7%D8%B6-%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D8%AC%D9%87%D8%A7%D8%B2-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A/%D8%A7%D9%84%D8%BA%D8%AB%D9%8A%D8%A7%D9%86-%D9%88%D8%A7%D9%84%D9%82%D9%8A%D8%A1-%D8%B9%D9%86%D8%AF-%D8%A7%D9%84%D8%A8%D8%A7%D9%84%D8%BA%D9%8A%D9%86#:~:text=%D8%AA%D9%8F%D8%B9%D8%AF%D9%8F%D9%91%20%D9%85%D9%8F%D8%AA%D9%84%D8%A7%D8%B2%D9%85%D8%A9%20%D8%A7%D9%84%D9%82%D9%8A%D8%A1%20%D8%A7%D9%84%D8%AF%D9%8E%D9%91%D9%88%D8%B1%D9%8A%20%D9%85%D9%86,%D8%AE%D9%84%D8%A7%D9%84%20%D8%A7%D9%84%D9%81%D8%AA%D8%B1%D8%A7%D8%AA%20%D8%A7%D9%84%D9%81%D8%A7%D8%B5%D9%84%D8%A9%20%D8%A8%D9%8A%D9%86%20%D8%A7%D9%84%D9%87%D8%AC%D9%85%D8%A7%D8%AA.            `,

},



]
,Doctors:[
  {
      Name:`الدكتور محمد علي`,
      Address:`القاهره , مصر`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01275111306`,
      
  },
 
]

    },
    {
      disease_id: 6,
      disease_name: `
      
      اضطراب تناول الطعام غير المحدد | Unspecified Feeding or Eating Disorder
                `,
      disease_nameAr:`اضطراب تناول الطعام غير المحدد`,
      
      disease_img:require('../../../assets/disease/download.jpeg'),
      disease_youtube:`
      https://www.youtube.com/embed/R_cGPgjSpQI
                      `,
      disease_description:
        `
        اضطراب تناول الطعام غير المحدد (Unspecified Eating Disorder) هو اضطراب يتعلق بالتغذية والأنماط الغذائية المشوهة والمخاوف المتعلقة بالجسم، ولكن لا يمكن تصنيفه بشكل صريح تحت أحد التصنيفات المعروفة للاضطرابات الغذائية مثل اضطرابات الأكل العصبي (Anorexia Nervosa) أو اضطرابات الأكل المفرط (Bulimia Nervosa).
        `,
     
     
        disease_causes:`
        اضطراب تناول الطعام غير المحدد هو حالة نفسية تتسم بنمط غير صحي في الأكل يتضمن سلوكيات متطرفة في تناول الطعام، مثل تناول كميات كبيرة جداً من الطعام (اضطراب الأكل المفرط) أو تناول كميات قليلة جداً من الطعام (اضطراب الأكل القليل)، وقد يصاحب ذلك أفكار سلبية حول الوزن والجسم وصورة الذات.

        توجد عدة أسباب محتملة لحدوث اضطراب تناول الطعام غير المحدد، وقد تكون هناك تفسيرات متعددة لظهور هذه الحالة لدى الأفراد. من بين الأسباب الشائعة:
        
        1. العوامل النفسية: قد يكون الإجهاد النفسي، القلق، الاكتئاب، انخفاض تقدير الذات واضطرابات الصورة الذاتية عوامل تسهم في حدوث اضطراب تناول الطعام غير المحدد.
        
        2. العوامل الاجتماعية والثقافية: ضغوط المجتمع، الوسائط الإعلامية، المعايير الجمالية المغلوطة، التنمر والضغط الاجتماعي يمكن أن تؤثر على علاقة الشخص بالطعام وتسهم في حدوث اضطراب تناول الطعام غير المحدد.
        
        3. العوامل الوراثية والبيولوجية: قد يكون هناك عوامل وراثية تجعل بعض الأشخاص أكثر عرضة لتطوير اضطرابات تناول الطعام. تلعب التغيرات الكيميائية في الدماغ واضطرابات التوازن الكيميائي دوراً محتملاً في تطور هذا الاضطراب.
        
        4. العوامل الشخصية: بعض العوامل الشخصية مثل الكمالية المفرطة، السيطرة الزائدة، رغبة السيطرة على الوزن والشكل، الرغبة في
        `,
        
        description_Sy:`
        
        اضطراب تناول الطعام غير المحدد هو حالة نفسية تتميز بتغيرات في النمط الغذائي وسلوك تناول الطعام، وتشمل اضطرابات مثل اضطراب الأكل النفسي واضطراب الأكل اللاحق للتناول الزائد. يتسبب هذا الاضطراب في تأثيرات سلبية على الصحة العامة والوظائف الجسدية والعقلية.            
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        فقدان الوزن بشكل كبير   
                           `
    },
        {
        symptoms_disease:`
        ينفي الشعور بالجوع                     `
    },
        {
        symptoms_disease:`

        التفكير السلبي والمشاعر السلبية المرتبطة بالجسم والطعام.

        
        `


},
        {
        symptoms_disease:`

        العزلة الاجتماعية: تجنب الأنشطة الاجتماعية التي تشمل الطعام أو تجربة الطعام مع الآخرين.


        
        `


},
        {
        symptoms_disease:`
        تقلبات في الوزن: زيادة أو انخفاض غير طبيعي في الوزن بشكل ملحوظ خلال فترة قصيرة.

        `
    },
        {
        symptoms_disease:`
        تفكير مهووس بالوزن والشكل الجسدي: التركيز المفرط على الوزن والشكل الجسدي، والشعور بعدم الرضا عن الجسم بشكل مستمر.                               `
    },
       

]
    ,

      disease_diagnosis:`

      أعتذر، ولكن يبدو أن هناك سوء تفاهم في السؤال. "اضطراب تناول الطعام غير المحدد" ليس تشخيصًا معترف به في مجال الاضطرابات الغذائية. ربما تقصد "اضطراب تناول الطعام غير الناحية العضوية"، وهو تصنيف يستخدم في الدليل التشخيصي والإحصائي للاضطرابات العقلية (DSM-5)، وهو مرجع معترف به عالميًا.

      يُعتبر "اضطراب تناول الطعام غير الناحية العضوية" مصطلحًا عامًا يشمل عدة اضطرابات، مثل:
      1. اضطراب التوتر النفسي في تناول الطعام (Avoidant/Restrictive Food Intake Disorder أو ARFID): يتميز بتجنب أو تقييد تناول الطعام بسبب تفادي معين للأطعمة المحددة أو تقييد الكمية المتنوعة للأطعمة المتاحة، وقد يؤدي ذلك إلى نقص التغذية والوزن.
      
      2. اضطراب الأكل النفسي (Eating Disorders): يشمل الأمراض الشهيرة مثل فرط الأكل العاطفي (Binge Eating Disorder) واضطراب الأكل التعسفي والتقيؤ (Bulimia Nervosa) واضطراب التصوير الجسدي (Body Dysmorphic Disorder)، وهي اضطرابات تناول الطعام التي تتأثر بشكل كبير بالعوامل النفسية.
      
      إذا كنت تشعر بأنك تعاني من أعراض معينة تتعلق بالتغذية أو الأكل، فمن المهم أن تستشير طبيبًا أو أخصائي نفسي متخصص في الاضطرابات الغذائية للحصول على تقييم دقيق وتشخيص محدد. سيتمكن المحترف الصحي من إجراء مقابلة شخصية وتقييم الأعراض وتوجيهك إلى العلاج المناسب إن لزم الأمر.          
      `,

      disease_treatment:`
اضطراب تناول الطعام غير المحدد (Unspecified Eating Disorder) يشير إلى حالة تناول الطعام المشوبة بالقلق والتوتر والتشويش على الصورة الذاتية، ولكن لا يستوفي الشروط الكافية لتشخيص اضطراب تحديد معين مثل اضطراب فرط الشهية (Binge Eating Disorder) أو اضطراب الأكل القليل جدًا (Avoidant/Restrictive Food Intake Disorder) أو اضطراب الأكل العصابي (Anorexia Nervosa) أو اضطراب الأكل المستحث (Bulimia Nervosa).

معالجة اضطراب تناول الطعام غير المحدد تعتمد على نوع وشدة الأعراض والتحديات الفردية التي يواجهها المريض. إليك بعض الخطوات التي يمكن أن تساعد:

1. البحث عن الدعم المهني: استشارة أخصائي نفسي متخصص في اضطرابات الأكل يمكن أن يكون مفيدًا جدًا. سيقوم المعالج بتقييم الحالة وتوفير الدعم والإرشاد المناسب للمريض.

2. العلاج النفسي: يتضمن العلاج النفسي مثل العلاج السلوكي المعرفي (Cognitive Behavioral Therapy - CBT) والعلاج العائلي أو العلاج الجماعي. يهدف العلاج إلى التعامل مع العوامل النفسية والسلوكية التي تؤثر على تناول الطعام.

3. الدعم الغذائي: قد يحتاج المريض إلى العمل مع أخصائي تغذية متخصص لتطوير علاقة صحية مع الطعام والتعامل مع القضايا الغذائية المرتبطة بالاضطراب.

4. الدعم الطبي: في بعض الحالات، قد يكون هناك حاجة للرعاية الطبية للتعامل مع المشاكل الصحية المرتبطة بالاضطراب، مثل النقص التغذوي أو التوتر البدني.

5. الدعم المجتمعي: تو

فير شبكة دعم قوية من الأصدقاء والعائلة يمكن أن يكون له تأثير إيجابي على مسار الشفاء.

يجب أن يكون العلاج شخصيًا ومصممًا وفقًا للحالة الفردية للمريض. لذا، ينبغي أن يتم استشارة أخصائي نفسي مؤهل لتقييم الحالة ووضع خطة علاج مناسبة.
      
      `,


      complications_of_the_disease:`
      الأساسية في الجسم، وفقدان الوزن الشديد، وضعف العضلات، ومشاكل القلب والجهاز الهضمي، وتلف العظام.

      المشاكل النفسية والعاطفية: يمكن أن يؤدي اضطراب تناول الطعام غير المحدد إلى الشعور بالاكتئاب والقلق، ونقص التركيز والانتباه، وتغيرات المزاج الشديدة، والعزلة الاجتماعية، وانخفاض تقدير الذات.
      
      المضاعفات الاجتماعية: قد يعاني الأشخاص الذين يعانون من اضطراب تناول الطعام غير المحدد من مشاكل في العلاقات الاجتماعية، وصعوبة التواصل مع الآخرين، وانعدام الثقة في الآخرين.
      
      المضاعفات الصحية العقلية: يمكن أن يتطور اضطراب تناول الطعام غير المحدد إلى اضطرابات تغذية أخرى مثل فرط الأكل المعتمد على العاطفة (BED) أو فرط الأكل العصبي (Binge Eating Disorder)، واضطراب الشهية القليلة (ARF 
      `,

      Medications_related_to_the_disease:
     `
     يعتمد العلاج لاضطرابات تناول الطعام على الحالة الفردية وقد يشمل تعاونًا متعدد التخصصات بين أطباء النفس والتغذية والعلاج النفسي. قد يشمل العلاج المحادثات الاستشارية والدعم النفسي والتغذية المتوازنة والتدريبات السلوكية المعرفية والعلاج الدوائي في بعض الحالات.
     `,

Sources_and_references:[
        
{
name:`
MAYOCLINIC
`,
links:`
https://www.mayoclinic.org/ar/diseases-conditions/eating-disorders/symptoms-causes/syc-20353603#:~:text=%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%20%D8%AA%D8%AC%D9%86%D9%8F%D9%91%D8%A8%2F%D8%AA%D9%82%D9%8A%D9%8A%D8%AF%20%D8%AA%D9%86%D8%A7%D9%88%D9%84%20%D8%A7%D9%84%D8%B7%D8%B9%D8%A7%D9%85&text=%D9%88%D9%82%D8%AF%20%D9%8A%D8%A4%D8%AF%D9%8A%20%D8%B0%D9%84%D9%83%20%D8%A5%D9%84%D9%89%20%D9%85%D8%B4%D9%83%D9%84%D8%A7%D8%AA,%D9%82%D9%88%D8%A7%D9%85%D9%87%D8%A7%20%D8%A3%D9%88%20%D8%B1%D8%A7%D8%A6%D8%AD%D8%AA%D9%87%D8%A7%20%D8%A3%D9%88%20%D9%86%D9%83%D9%87%D8%AA%D9%87%D8%A7.`
},



] ,Doctors:[
  {
      Name:`الدكتور ياسر سعيد`,
      Address:`المقطم , مصر`,
      img:require('../../../assets/Doc/WhatsApp-Image-2022-03-07-at-5.57.03-PM-160x160.jpeg'),
      Phone:`01118613737`,
      
  },

]

    },
    {
      disease_id: 7,
      disease_name: `
      
     اضطراب الشراهة الليلي  | Night Eating Syndrome,
      `,
      disease_nameAr:`
      اضطراب الشراهة الليلي          
      `

      ,
      
      disease_img:require('../../../assets/disease/qyhqvY1fVz-Annajah.jpg_729x410.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/6ZRIr12FRGY                   `,
      disease_description:
        `
        متلازمة الأكل الليلي (NES) هي حالة تجمع بين الإفراط في تناول الطعام في الليل ومشاكل النوم. مع NES ، تأكل كثيرًا بعد العشاء ، وتجد صعوبة في النوم ، وتأكل عندما تستيقظ ليلًا.

        `,
     
     
        disease_causes:`
        انه غير واضح. يعتقد الأطباء أنه قد يكون مرتبطًا بمشاكل في دورة النوم والاستيقاظ وبعض الهرمونات. التغييرات في جدول نومك وروتينك ليست مسؤولة.

        تزداد احتمالية إصابتك بمتلازمة الأكل الليلي إذا كنت تعاني من السمنة أو اضطراب أكل آخر. إن تاريخ الإصابة بالاكتئاب والقلق وتعاطي المخدرات أكثر شيوعًا لدى الأشخاص المصابين بمتلازمة النفق الرسغي.
        
        تؤثر NES على أكثر بقليل من 1 من كل 100 شخص. إذا كنت تعاني من السمنة ، فهناك احتمال واحد من كل 10 أن تكون مصابًا بها.
              
        `,
        
        description_Sy:`
        
        إذا كان لديك NES ، فأنت تأكل على الأقل ربع السعرات الحرارية اليومية بعد العشاء. هذه الحقيقة تزعجك أيضًا.

        إذا كان هذا أنت ، واستيقظت لتناول الطعام مرتين على الأقل في الأسبوع ، فقد يكون لديك NES إذا كان لديك أيضًا ثلاثة على الأقل من هذه:
        
        تختلف متلازمة الأكل الليلي عن اضطراب الأكل بنهم. مع BED ، من المرجح أن تأكل كثيرًا في جلسة واحدة. إذا كان لديك NES ، فمن المحتمل أنك تأكل كميات أقل طوال الليل.
                          `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        قلة الشهية في الصباح
                             `
    },
        {
        symptoms_disease:`
        دافع قوي لتناول الطعام بين العشاء والنوم
                           `
    },
        {
        symptoms_disease:`
        الأرق أربع أو خمس ليال في الأسبوع

`

},
        {
        symptoms_disease:`
        مزاج مكتئب يزداد سوءًا خلال ساعات المساء

`

},

]
    ,

      disease_diagnosis:`
      سيشخص طبيبك متلازمة الأكل الليلي بعد أن يطرح عليك أسئلة حول نومك وعاداتك في الأكل. يمكن أن يشمل هذا استبيان مفصل. قد يكون لديك أيضًا اختبار نوم يسمى تخطيط النوم. يقيس الخاص بك:

      موجات الدماغ
      مستويات الأكسجين في الدم
      معدل ضربات القلب والتنفس
      عادة ، سيكون لديك تخطيط النوم في المستشفى أو مركز النوم.
      
      لكي يتم تشخيصك بمرض NES ، تحتاج إلى تناول وجبة دسمة في الليل لمدة 3 أشهر على الأقل. لا يمكن أن تكون أنماط الأكل والنوم أيضًا بسبب تعاطي المخدرات أو اضطراب طبي أو دواء أو مشكلة نفسية أخرى.
           
      
      `,
      disease_treatment:`

      يبدو أن مضادات الاكتئاب والعلاج السلوكي المعرفي يساعدان ، على الرغم من إجراء القليل من الدراسات على NES. وجدت إحدى الدراسات الصغيرة أن التدريب على الاسترخاء ساعد في تحويل الشهية من الليل إلى الصباح.

      أظهرت العديد من الدراسات حول مضادات الاكتئاب تحسنًا مع تناول الطعام ليلاً والمزاج ونوعية الحياة.
      
      يمكنك أيضًا تناول الميلاتونين أو المواد التي تعزز الميلاتونين من أجل NES.
      
      كالعادة ، تحدث مع طبيبك قبل أن تأخذ أي شيء.
            

      
      `,


      complications_of_the_disease:`

      تشمل المضاعفات المحتملة لاضطراب الشراهة الليلي ما يلي:

      زيادة الوزن: تناول كميات كبيرة من الطعام في الليل يمكن أن يؤدي إلى زيادة الوزن، وبالتالي زيادة خطر الإصابة بالسمنة والأمراض المرتبطة بها مثل ارتفاع ضغط الدم والسكري من النوع 2 وأمراض القلب.
      
      اضطرابات النوم: يعاني الأشخاص المصابون بالشراهة الليلية من اضطرابات في نوعية النوم والاستيقاظ المتكرر في الليل لتناول الطعام. قد يتسبب ذلك في عدم الشعور بالراحة والتعب النهاري وقلة التركيز.
      
      الاضطرابات النفسية: قد يعاني المصابون بالشراهة الليلية من الاكتئاب والقلق واضطرابات النظم الغذائية الأخرى مثل اضطرابات الأكل المفرط واضطرابات الأكل القليل. يمكن أن يزيد هذا من العبء النفسي ويؤثر على الجودة العامة للحياة.
      
      اضطرابات الهضم: تناول كميات كبيرة من الطعام في وقت متأخر من الليل يمكن أن يتسبب في مشاكل هضمية مثل حموضة المعدة وارتداد حمض المعدة والانتفاخ.
      
      الشعور بالعار والعجز: قد يعاني الأشخاص المصابون بالشراهة الليلية من الشع
      
      
      
      
       
      `,

      Medications_related_to_the_disease:
     `

     لا يوجد دواء محدد معتمد بشكل عام لعلاج اضطراب الشراهة الليلي، ولكن قد يقوم الأطباء بوصف بعض الأدوية التي قد تساعد في تقليل الرغبة في الأكل أو تعديل نمط النوم، وذلك حسب تقييمهم الطبي والحالة الفردية للمريض.`,

Sources_and_references:[
        
{
name:`
WebMD
`,
links:`
https://www.webmd.com/mental-health/eating-disorders/binge-eating-disorder/what-is-night-eating-syndrome`

},



]
,Doctors:[
  {
      Name:`الدكتور أحمد الشحات`,
      Address:`اجا , الدقهلية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01006396601`,
      
  },
  {
      Name:`الدكتور أحمد حسن`,
      Address:`باكوس , اسكندرية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`035733776`,
      
  }
]

    },
    {
      disease_id: 8,
      disease_name: `
      

أضطراب الأكل العاطفي | Emotional Eating          `,
      disease_nameAr:`الأضطراب الأكل العاطفي`,
      
      disease_img:require('../../../assets/disease/Emotional_eating_sad.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/NJzIS590vWk                              `,
      disease_description:
        `
        الأكل العاطفي هو تناول الأكل كوسيلة لقمع أو تهدئة المشاعر السلبية، مثل التوتر، والغضب، والخوف، والملل، والحزن، والشعور بالوحدة. يمكن أن تؤدي الأحداث الكبرى في الحياة أو على نحو أكثر شيوعًا، متاعب الحياة اليومية إلى إثارة مشاعر سلبية تؤدي إلى الأكل العاطفي وتعطيل جهودك في إنقاص الوزن.
        `,
     
     
        disease_causes:`
        قد تتضمَّن هذه المحفزات ما يلي:

        مشاكل في العلاقات
        عوامل ضغط في العمل أو أخرى
        الإرهاق
        ضغوط مالية
        مشاكل صحية
        `,
        
        description_Sy:`
        
        بشكل عام ، تشير السلوكيات والمواقف إلى أن فقدان الوزن واتباع نظام غذائي والتحكم في الطعام أصبحت من الاهتمامات الأساسية
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        مشاكل في العلاقات
`        },
        {
        symptoms_disease:`
        ضغوط مالية
        `
    },
        {
        symptoms_disease:`
        مشاكل صحية
        `


},
        {
        symptoms_disease:`
        عوامل ضغط في العمل أو أخرى
        `
    },
        {
        symptoms_disease:`
        الإرهاق
        `
    },

       

]
    ,

      disease_diagnosis:`

      تشخيص اضطراب الأكل العاطفي يعتمد على مجموعة من المعايير المحددة التي وضعتها الجمعية الأمريكية للاضطرابات النفسية (APA) في الدليل التشخيصي والإحصائي للاضطرابات العقلية (DSM-5). بعض من هذه المعايير تشمل:

      تناول كميات كبيرة من الطعام خلال فترة زمنية محددة (على سبيل المثال، ساعتين) بمعدل مرتين أو أكثر في الأسبوع لمدة تزيد عن ثلاثة أشهر.
      الشعور بعدم السيطرة على عملية التناول وعدم القدرة على التوقف.
      عدم وجود سلوك تعويضي مثل الاستفراغ العمدي بعد تناول الطعام.
      التواجد المستمر للشعور بالعار أو الاستياء من النفس بعد التناول المفرط.
      من المهم أن يتم تشخيص اضطراب الأكل العاطفي بواسطة متخصص في الصحة النفسية مثل ال          
      `,
      disease_treatment:`

      وعندما تهدد العواطف السلبية بإثارة الإحساس النفسي بالجوع، يمكنك اتخاذ خطوات للسيطرة على الرغبة الشديدة في الأكل. وللمساعدة في التوقف عن الأكل القائم على الإحساس النفسي بالجوع، جرب النصائح التالية:

      احتفظ بمفكرة غذائية. دوِّن ماذا تأكل، والكمية التي تأكلها، ومتى تأكل، وشعورك أثناء الأكل، ومدى إحساسك بالجوع. قد ترى بمرور الوقت أنماطًا تكشف العلاقة بين المزاج والطعام.
      روض ضغوطك النفسية. إذا كان الضغط النفسي يساهم في تناولك للأكل، فجرّب أسلوبًا لإدارة ذلك الضغط النفسي، مثل اليوغا أو التأمل أو التنفس العميق.
      تحقق من واقعية إحساسك بالجوع. هل إحساسك بالجوع حسي أم نفسي؟ إذا كنت قد أكلت قبل ساعات قليلة ولم تكن تسمع صوت قرقرة في معدتك، فمن المحتمل أنك لست جائعًا. امنح الإحساس بالرغبة بعض الوقت حتى تزول.
      احصل على دعم. من المرجح أن تستسلم للأكل النفسي إذا كنت تفتقر إلى شبكة دعم جيدة. اعتمد على العائلة والأصدقاء أو فكر في الانضمام إلى مجموعة دعم.
      حارب الملل. بدلاً من تناول وجبة خفيفة عندما لا تكون جائعًا، اصرف انتباهك واستبدل ذلك بسلوك صحي. يمكنك المشي أو مشاهدة فيلم أو اللعب مع قطتك أو الاستماع إلى الموسيقى أو القراءة أو تصفح الإنترنت أو الاتصال بصديق.
      تخلص من المغريات. لا تحتفظ بالأطعمة السهلة التي يصعب مقاومتها في منزلك. وإذا كنت تشعر بالغضب أو الحزن والاكتئاب، فأجل جولتك في متجر البقالة حتى تتأكد من مشاعرك.
      لا تحرم نفسك. عند محاولة إنقاص وزنك، قد تحد من السعرات الحرارية أكثر من اللازم، وتتناول الأطعمة نفسها مرارًا، وتتجنب الحلويات. فقد يؤدي هذا فقط إلى زيادة الرغبة في تناول الطعام، لا سيما أذا كان ذلك استجابةً للمشاعر. لذا، ينبغي أن تتناول كميات مرضية من الأطعمة الصحية، وتتمتع بتناول الحلويات من حين لآخر، وتحصل على تنويع أكبر للمساعدة في كبح الرغبة الشديدة.
      تناول وجبات خفيفةً صحيةً. إذا كنت تشعر بالرغبة في تناول الطعام بين الوجبات، فاختر وجبةً خفيفةً صحيةً، مثل الفواكه الطازجة أو الخضراوات قليلة الدهون أو المكسرات أو الفشار دون زبدة. أو جرِّب أنواعًا منخفضة السعرات الحرارية من الأطعمة التي تفضلها لمعرفة ما إذا كانت تلبي رغبتك.
      تعلم من الانتكاسات. إذا كنت قد دخلت في دوامة من الأكل النفسي، فلا تلوم نفسك كثيرًا وابدأ من جديد في اليوم التالي. وحاول أن تتعلم من التجربة وضع خطة لكيفية منع تكرار ذلك في المستقبل. ركز على التغييرات الإيجابية التي أحدثتها في عاداتك الغذائية واعزو لنفسك الفضل في إحداث تغييرات تؤدي إلى التمتع بصحة أفضل

      
      `,


      complications_of_the_disease:`

      من الممكن أن يؤدي اضطراب الأكل العاطفي إلى مضاعفات صحية ونفسية. بعض المضاعفات المحتملة تشمل:

      زيادة الوزن: تناول كميات كبيرة من الطعام بشكل متكرر يمكن أن يؤدي إلى زيادة الوزن والسمنة.
      
      مشاكل الصحة الجسدية: قد يزيد الوزن المفرط من خطر الإصابة بأمراض القلب وارتفاع ضغط الدم والسكري من النوع 2 وأمراض الكبد وبعض أنواع السرطان.
      
      مشاكل الصحة النفسية: قد يزيد اضطراب الأكل العاطفي من الشعور بالذنب والعار والاكتئاب والقلق وانخفاض التقدير الذاتي.
      
      دورة مفرطة من التوتر العاطفي: يمكن أن يؤدي الانتهاك المستمر للأكل العاطفي إلى دورة مفرطة من التوتر العاطفي والاستجابة بتناول المزيد من الطعام كوسيلة للتخفيف.          `,

      Medications_related_to_the_disease:
     `
     لا يوجد دواء معين 
`,

Sources_and_references:[
        
{
name:`
أدلةMSD
`,
links:`
https://www.msdmanuals.com/ar/home/%D8%A7%D9%84%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A%D9%91%D9%8E%D8%A9/%D8%A3%D8%B9%D8%B1%D8%A7%D8%B6-%D8%A7%D8%B6%D8%B7%D8%B1%D8%A7%D8%A8%D8%A7%D8%AA-%D8%A7%D9%84%D8%AC%D9%87%D8%A7%D8%B2-%D8%A7%D9%84%D9%87%D8%B6%D9%85%D9%8A/%D8%A7%D9%84%D8%BA%D8%AB%D9%8A%D8%A7%D9%86-%D9%88%D8%A7%D9%84%D9%82%D9%8A%D8%A1-%D8%B9%D9%86%D8%AF-%D8%A7%D9%84%D8%A8%D8%A7%D9%84%D8%BA%D9%8A%D9%86#:~:text=%D8%AA%D9%8F%D8%B9%D8%AF%D9%8F%D9%91%20%D9%85%D9%8F%D8%AA%D9%84%D8%A7%D8%B2%D9%85%D8%A9%20%D8%A7%D9%84%D9%82%D9%8A%D8%A1%20%D8%A7%D9%84%D8%AF%D9%8E%D9%91%D9%88%D8%B1%D9%8A%20%D9%85%D9%86,%D8%AE%D9%84%D8%A7%D9%84%20%D8%A7%D9%84%D9%81%D8%AA%D8%B1%D8%A7%D8%AA%20%D8%A7%D9%84%D9%81%D8%A7%D8%B5%D9%84%D8%A9%20%D8%A8%D9%8A%D9%86%20%D8%A7%D9%84%D9%87%D8%AC%D9%85%D8%A7%D8%AA.            `,

},



]
,Doctors:[
  {
      Name:`الدكتور أحمد بن غلاب`,
      Address:`وسط البلد , كفر الشيخ`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01223851062`,
      
  },
  {
      Name:`الدكتور أحمد خيري`,
      Address:`الحي السابع , اكتوبر`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01004039471`,
      
  }
]

    },
    {
        disease_id: 9,
        disease_name: `
        
        أضطراب تناول الطعام في فتره النوم الليليه | Other Specified Feeding and Eating Disorder 
        `,
        disease_nameAr:`أضطراب تناول الطعام في فتره النوم الليليه`,
        
        disease_img:require('../../../assets/disease/1614025110064-gettyimages-683125828.jpg'),
        disease_youtube:`
        https://www.youtube.com/embed/dqonmx_axlE                      `,
        disease_description:
          `
          اضطراب التغذية والأكل المحدد الآخر (OSFED) هو تصنيف لاضطراب الأكل لأولئك الذين لا يستوفون المعايير التشخيصية لأي اضطرابات أكل أخرى. حل OSFED محل عبارة "اضطراب الأكل غير المحدد بطريقة أخرى (EDNOS)" في الدليل التشخيصي والإحصائي (DSM-IV).

          قد يعاني الأفراد المصابون بـ OSFED من عادات غذائية مضطربة ، أو صورة مشوهة للجسم ، أو تقدير مبالغ فيه لشكل الجسم ووزنه ، أو خوفًا شديدًا من زيادة الوزن. OSFED هو اضطراب الأكل الأكثر شيوعًا الذي يتم تشخيصه للبالغين وكذلك المراهقين ويؤثر على الناس من جميع الأجناس.
          `,
       
       
          disease_causes:`
          اضطراب الأكل في فترة النوم الليلية يعرف أيضًا بـ "اضطراب الأكل الليلي" أو "الأكل الليلي الزائد" (Night Eating Syndrome)، وهو حالة تتميز بنمط غير طبيعي في استهلاك الطعام خلال فترة الليل مع صعوبة في الاستيقاظ للتناول الصحيح للوجبات النهارية. هناك عدة أسباب محتملة لحدوث هذا الاضطراب، ومنها:

          1. التوتر والقلق: يمكن أن يلجأ البعض إلى تناول الطعام في الليل كوسيلة للتخفيف من التوتر والقلق النفسي الذي يعانون منه. قد يجدون الأكل في الليل طريقة للتهدئة والاسترخاء.
          
          2. العادات الغذائية غير المنتظمة: قد يكون لدى الأشخاص الذين يعانون من اضطراب الأكل الليلي عادات غذائية غير منتظم
          `,
          
          description_Sy:`
          
          بشكل عام ، تشير السلوكيات والمواقف إلى أن فقدان الوزن واتباع نظام غذائي والتحكم في الطعام أصبحت من الاهتمامات الأساسية
         
          `
          ,
        Symptoms_of_the_disease:
        [
          {
          symptoms_disease:`
          الأكل اللاواعي     
                                    `
      },
          {
          symptoms_disease:`

          الأكل الزائد    
                               `
      },
          {
          symptoms_disease:`

          
التشويش النهاري`



},
          {
          symptoms_disease:`
          القلق والتوتر       
                       `
      },
          
         
  
  ]
      ,
  
        disease_diagnosis:`

        يجب عليك استشارة متخصص في الصحة النفسية أو طبيب للحصول على تقييم دقيق وتشخيص لحالتك. قد يكون من الأفضل البحث عن طبيب نفسي أو طبيب متخصص في اضطرابات الأكل والنوم الليلي في منطقتك ومناقشة أعراضك ومخاوفك معه. يمكنهم تقديم التقييم والدعم المناسب لمساعدتك في فهم ومعالجة الوضع.          
        `,
        disease_treatment:`

       
توجد بعض الاستراتيجيات التي يمكن أن تساعد في علاج اضطراب الأكل أثناء فترة النوم الليلية. إليك بعض النصائح التي قد تكون مفيدة:

الحفاظ على نمط حياة صحي: حافظ على نمط حياة منتظم وصحي على مدار اليوم، بما في ذلك تنظيم وجباتك الرئيسية وتجنب التسرع في الأكل.

التقليل من الإثارة والتوتر: حاول تخفيف الإثارة والتوتر الذي يمكن أن يساهم في زيادة احتمالية حدوث هذا النوع من الاضطرابات. استخدم تقنيات التأمل أو الاسترخاء قبل النوم لتهدئة العقل والجسم.

تحسين نوعية النوم: قم بإنشاء بيئة مريحة للنوم وحاول الحصول على قسط كافٍ من النوم الجيد في الليل. النوم الجيد يمكن أن يساعد في تقليل الرغبة في تناول الطعام في فترة النوم.

ممارسة الرياضة: قم بممارسة التمارين الرياضية بانتظام، وذلك للمساهمة في تنظيم نمط النوم وتخفيف التوتر النفسي والعاطفي.


        
        `,


        complications_of_the_disease:`

        زيادة الوزن: قد يؤدي تناول كميات كبيرة من الطعام في الليل دون ممارسة النشاط البدني المناسب إلى زيادة الوزن والسمنة.

الاضطرابات الهضمية: قد يعاني الأشخاص المصابون بالاضطراب الليلي من مشاكل هضمية مثل الحموضة المعديّة، والانتفاخ، والشعور بالانزعاج العام.

اضطرابات النوم: قد يتأثر نوعية النوم ونمط النوم لدى الأشخاص المصابين بالاضطراب الليلي. قد يعانون من صعوبة في النوم أو استيقاظ متكرر في وقت متأخر من الليل لتناول الطعام.


        `,

        Medications_related_to_the_disease:
       `
       لا يوجد دواء محدد لعلاج هذا الاضطراب بشكل خاص، حيث يعتمد العلاج على معالجة الأسباب الكامنة والتعامل مع المشكلة الأساسية.

       `,

Sources_and_references:[
          
  {
  name:`
  Cleveland Clinic
  `,
  links:`
  https://my.clevelandclinic.org/health/diseases/21730-sleep-related-eating-disorders`
},



]
,Doctors:[
  {
      Name:`الدكتور أحمد حامد`,
      Address:`شمال سفاجا , سفاجا`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`0653256717`,
      
  },
  {
      Name:`الدكتور أحمد عز العرب`,
      Address:`شبين الكوم , المنوفية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01025260425`,
      
  }
]
  
      },
    {
      disease_id: 10,
      disease_name: `
      
      أضطراب الأفراط في تناول الالياف الغذائية | Fiber Related Eating Disorder
      `,
      disease_nameAr:`أضطراب الأفراط في تناول الالياف الغذائية`,
      
      disease_img:require('../../../assets/img/229e19b9c258a936126ace4f9039719a.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/yOv1KEoc0B0`,
      disease_description:
        `
      
        اضطراب تناول الألياف الغذائية هو حالة يعاني فيها الشخص من صعوبة في تناول كمية كافية من الألياف الغذائية في نظامه الغذائي. تعتبر الألياف الغذائية جزءًا هامًا من النظام الغذائي الصحي، حيث تساهم في صحة الجهاز الهضمي وتقليل مخاطر الإصابة بالأمراض المزمنة مثل السمنة، وأمراض القلب، والسكري
`,
     
     
        disease_causes:`
        اختيار الأطعمة الغذائية: بعض الأشخاص قد يفضلون تناول الأطعمة المكررة والمكربنة التي تحتوي على كمية قليلة من الألياف الغذائية، مثل الأطعمة المصنعة والوجبات السريعة. قد يكون ذلك بسبب الرغبة في النكهات الشهية والسهولة في التحضير.

        نمط الحياة: يمكن أن يؤثر نمط الحياة المزدحم والسريع على تناول الألياف الغذائية. على سبيل المثال، قد يكون لديك وقت محدود لتحضير وجبات صحية وتحتوي على الألياف، أو قد يكون لديك تفضيل للوجبات السريعة التي تكون عادة قليلة الألياف.
        
        قلة الوعي الغذائي: قد يكون الاضطراب في تناول الألياف الغذائية نتيجة قلة الوعي بأهمية الألياف والأطعمة التي تحتوي عليها. إذا لم يتم توجيه الاهتمام الكافي لهذه المكونات الغذائية، فقد يتجاهل الشخص تناول الألياف الغذائية بشكل عام
        `,
        
        description_Sy:`
        
        بشكل عام ، تشير السلوكيات والمواقف إلى أن فقدان الوزن واتباع نظام غذائي والتحكم في الطعام أصبحت من الاهتمامات الأساسية
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        قلة تناول الخضروات والفواكه                        `
    },
       

        {
        symptoms_disease:`
        نقص الطاقة والشعور بالإرهاق                              `
    },
        {
        symptoms_disease:`
        مشاكل في الجهاز الهضمي       
                          `
    },
       

]
    ,

      disease_diagnosis:`

      قلة تناول الخضروات والفواكه: قد يكون الفرد غير قادر على تناول كمية كافية من الخضروات والفواكه، التي تعتبر مصدرًا غنيًا بالألياف الغذائية.

      مشاكل في الجهاز الهضمي: يمكن أن يعاني الفرد من اضطرابات في الجهاز الهضمي مثل الإمساك المزمن، والغازات، وانتفاخ البطن، والإسهال.
      
      شعور بالشبع السريع: قد يشعر الفرد بالشبع بسرعة بسبب قلة تناوله للألياف الغذائية، مما يؤدي إلى تناول كميات أقل من الطعام بشكل عام.
      
      نقص الطاقة والشعور بالإرهاق: يمكن أن يشعر الفرد بنقص الطاقة والشعور بالإرهاق نتيجة لعدم تناوله كمية كافية من الألياف الغذائية، التي تعتبر مصدرًا هامًا للطاقة.          `,
      disease_treatment:`

      يُعاني العديد من الأشخاص من اضطرابات في تناول الألياف الغذائية، وتعد هذه المشكلة شائعة وقد تكون مؤقتة أو مزمنة. لا يوجد دواء محدد لعلاج اضطراب تناول الألياف الغذائية، ولكن هناك بعض الإرشادات الغذائية والتغذوية التي يمكن أن تساعد في التحكم في هذه المشكلة. إليك بعض النصائح العامة:

      1. زيادة تناول الألياف: قم بزيادة تناول الألياف الغذائية تدريجياً في نظامك الغذائي. استهلك الفواكه والخضروات الطازجة، والحبوب الكاملة مثل الشوفان والأرز البني، والبقوليات مثل الفاصوليا والعدس.
      
      2. شرب السوائل: تناول كمية كافية من السوائل يمكن أن يساعد في تحسين حركة الأمعاء وتسهيل عملية الهضم. اشرب الماء والسوائل الأخرى بانتظام.
      
      3. تجنب الأطعمة المكررة والمصفاة: تجنب الأطعمة المصنعة والمكررة التي تكون غنية بالدهون والسكريات والمواد الحافظة. حاول تناول الأطعمة الطبيعية والمفيدة لصحتك.
      
      4. تقسيم الوجبات: قم بتقسيم الوجبات الكبيرة إلى وجبات صغيرة وتناولها على مدار اليوم. هذا يمكن أن يساعد في تسهيل عملية الهضم وامتصاص الألياف.
      
      5. ممارسة النشاط البدني: قم بممارسة النشاط البدني بانتظام، فهو يساعد على تحريك الأمعاء وتعزيز عملية الهضم.
      
      إذا استمرت مشكلة اضطراب تناول الألياف الغذائية لفترة طويلة وتسببت في مشاكل صحية مستمر
      
      `,


      complications_of_the_disease:`

    
اضطراب تناول الألياف الغذائية قد يؤدي إلى مضاعفات صحية مختلفة. هنا بعض المضاعفات الشائعة لهذا الاضطراب:

انتفاخ البطن: قد يعاني الأشخاص الذين لا يتناولون كمية كافية من الألياف من مشاكل في الجهاز الهضمي، بما في ذلك انتفاخ البطن والغازات.

الإمساك: الألياف الغذائية تساعد في تحسين حركة الأمعاء وتسهم في تسهيل عملية الإخراج. وبالتالي، إذا كنت تتناول كمية غير كافية من الألياف، فقد تواجه مشاكل في الإمساك.

زيادة خطر الإصابة بأمراض القولون: تناول الألياف الغذائية يمكن أن يحمي من بعض الأمراض القولونية مثل البواسير والقولون العصبي. وعدم تناول كمية كافية من الألياف يزيد من خطر الإصابة بهذه الحالات.
      `,

      Medications_related_to_the_disease:
     `
     زيادة تناول الألياف وتجنب الأطعمة المكررة والمصفاة وممارسة النشاط البدني`,

Sources_and_references:[
        
{
name:`
أدلةMSD
`,
links:`
https://www.msdmanuals.com/home/disorders-of-nutrition/overview-of-nutrition/fiber`
},



]
,Doctors:[
  {
      Name:`الدكتور أحمد محمد`,
      Address:`الزقايق , الشرقية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`0552590390`,
      
  },
  {
      Name:`الدكتور أحمد مرسي`,
      Address:`المحلة الكبري , الغربية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`0402247077`,
      
  }
]

    },
   
    {
      disease_id: 11,
      disease_name: `
      
      أضطراب تناول الطعام بشكل زائف | Feeding Disorder Of Infancy And Childhood
      `,
      disease_nameAr:`أضطراب تناول الطعام بشكل زائف`,
      
      disease_img:require('../../../assets/disease/210875-الافراط-فى-تناول-الطعام.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/vEFrZ-os2rE                  `,
      disease_description:
        `
        اضطراب تناول الطعام بشكل زائف هو اضطراب يتميز بتوجه نحو تغيير نمط التغذية أو القلق المفرط بشأن الوزن والمظهر الجسدي، دون أن يتوفر في الحقيقة أعراض مرضية جسدية أو عوامل تبرر هذا الانشغال الشديد بالتغذية. يُعرف هذا الاضطراب أيضًا باسم اضطراب القلق النفسي بشأن الشكل الجسدي (Body Dysmorphic Disorder) أو اضطراب اضطراب الأكل النفسي غير المحدد (Eating Disorder Not Otherwise Specified).
        `,
     
     
        disease_causes:`
       
توجد العديد من الأسباب المحتملة لاضطراب تناول الطعام الزائف، ومنها:

الضغوط الاجتماعية والثقافية: يمكن أن تؤثر الضغوط الاجتماعية والتوقعات الثقافية بشأن الجمال والوزن على العديد من الأشخاص، مما يجعلهم يشعرون بالقلق بشأن مظهرهم ووزنهم. يمكن أن يدفع هذا القلق بعض الأشخاص إلى تبني أنماط غير صحية في الأكل.

اضطرابات الصورة الذاتية: الاضطرابات في صورة الذات وعدم الارتياح بالجسم قد يؤدي إلى سلوكيات تجاه الطعام غير الصحية. قد يحاول الأشخاص استخدام التحكم في الأكل والوزن كوسيلة للشعور بالتحكم في حياتهم وتحسين صورتهم الذاتية.

القلق والاكتئاب: الأشخاص الذين يعانون من القلق والاكتئاب قد يلجؤون إلى الطعام كوسيلة للتعامل مع المشاعر السلبية أو لتخفيف القلق المؤقت. قد يكون تناول الطعام أو تجنبه وسيلة للتحكم في المشاعر والتعبير عنها.

العوامل الوراثية: هناك بعض الدلائل على أن العوامل الوراثية قد تكون لها تأثير في اضطرابات تناول الطعام، بما في ذلك الاضطرابات الزائفة. قد يكون هناك ع
        `,
        
        description_Sy:`
        
        تشمل أعراض اضطراب تناول الطعام بشكل زائف التفكير المهووس بالوزن والشكل الجسدي، والقلق المستمر من السمنة رغم الوزن الطبيعي أو النحافة الملحوظة، والانشغال المفرط بعدد السعرات الحرارية التي يتم استهلاكها، والتفكير المستمر في النظام الغذائي      
        
        `
        ,
      Symptoms_of_the_disease:
      [
        {
        symptoms_disease:`
        الانسحاب الاجتماعي بسبب قلق الشكل الجسدي             
                        `
    },
        {
        symptoms_disease:`
        التمارين الرياضية بشكل مفرط                    `
    },
       
       

]
    ,

      disease_diagnosis:`
      تشخيص اضطراب تناول الطعام الزائف يتطلب تقييمًا شاملاً من قبل محترف في الصحة العقلية، مثل طبيب نفساني أو مستشار تغذية مؤهل. قد يتضمن التشخيص عدة عناصر، مثل:

      تقييم السلوك والتفكير المرتبط بالطعام: يشمل ذلك دراسة الأنماط الغذائية غير الصحية مثل تجنب الأطعمة الغنية بالسعرات الحرارية أو تناول الكميات الصغيرة جدًا.
      
      تقييم الاعتقادات والمشاعر المرتبطة بالجسم: يركز هذا الجزء من التقييم على الاعتقادات السلبية حول الجسم والانشغال المفرط بالوزن والشكل الجسماني.
      
      الاستبعاد الأمراض العضوية: يجب استبعاد الأسباب العضوية للتغيرات في الشهية والتناول الغذائي، مثل اضطرابات الغدة الدرقية أو مشاكل الجهاز الهضمي.
      
      التقييم الجسدي: يمكن أن يشمل فحص الطول والوزن ومؤشر كتلة الجسم (BMI) والفحوصات الطبية الأخرى لتقييم الصحة العامة والتأثيرات البدنية للاضطراب.
      
      `,
      disease_treatment:`
      علاج اضطراب تناول الطعام الزائف يتطلب تعاون فريق متعدد التخصصات، ويشمل عادة الأخصائيين التاليين:

      أخصائي تغذية: يقوم بتقييم حالة المريض ووضع خطة تغذية ملائمة لاستعادة الوزن المناسب وتلبية احتياجاته الغذائية.
      
      أخصائي نفسي/علاج نفسي: يعمل على معالجة الجوانب النفسية للحالة ويساعد المريض على فهم العوامل النفسية التي تؤثر على علاقته مع الطعام والجسم، ويقدم استراتيجيات لتغيير السلوكيات الضارة وتعزيز الصورة الذاتية الإيجابية.
      
      طبيب نفساني/أخصائي علاج الأدوية: قد يقوم بتقييم حالة المريض وصرف الأدوية إذا اقتضت الحاجة، مثل مضادات الاكتئاب أو مثبطات القلق، للتعامل مع الاضطرابات النفسية المصاحبة.
      
      أخصائي نشاط بدني: يساعد المريض على تطوير علاقة صحية مع النشاط البدني ويقدم برامج تمارين مناسبة للمساعدة في تعزيز اللياقة البدنية وتحسين الصحة العامة.
      
      `,


      complications_of_the_disease:`

      هناك نقص عام في الفهم فيما يتعلق بخطورة OSFED وأهمية العلاج المهني لأولئك الذين يعانون من الاضطرابات التي تندرج تحت هذه الفئة. من المفاهيم الخاطئة الشائعة حول OSFED أنها ليست شديدة ، ويعتقد البعض أن الأشخاص الذين يعانون من OSFED لا يحتاجون إلى العلاج.

      يمكن أن يؤدي تأخير العلاج إلى تطوير اضطرابات متزامنة أو تفاقم شدة الاضطراب الحالي ، ويحتاج الأشخاص المصابون بـ OSFED إلى العلاج تمامًا مثل أولئك الذين يعانون من أي اضطراب أكل آخر.
      
      `,

      Medications_related_to_the_disease:
     `
     يتعين استشارة الطبيب المتخصص لتشخيص الحالة ووصف الدواء المناسب وتحديد الجرعة المناسبة. قد يشمل علاج اضطراب تناول الطعام الزائف توجيهات غذائية محددة والمشورة النفسية، إلى جانب الدواء.         
`,

Sources_and_references:[
        
{
name:`
Medical Center
`,
links:`
https://hhma.org/healthadvisor/pa-feedisin-bhp/#:~:text=Feeding%20disorder%20of%20infancy%20or%20early%20childhood%20is%20when%20an,fails%20to%20gain%20weight%20normally.`
},



]
,Doctors:[
  {
      Name:`الدكتور جرجس روماني`,
      Address:`وسط البلد , قنا`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01222872060`,
      
  },
  {
      Name:`الدكتور جلال عبدالعظيم`,
      Address:`محطه الرمل , الأسكندرية`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`034875535`,
      
  }
]

    },
    {
      disease_id: 12,
      disease_name: `
      
      اضطرابات التغذيه المرتبطه بالامراض النفسية  | Nutritional quality associated with mental illness          `,
      disease_nameAr:`اضطرابات التغذيه المرتبطه بالامراض النفسية`,
      
      disease_img:require('../../../assets/disease/الأكل-1-scaled-1.jpg'),
      disease_youtube:`
      https://www.youtube.com/embed/mcAgMD4l480               `,
      disease_description:
        `
        اضطرابات التغذية المرتبطة بالأمراض النفسية هي مجموعة من الاضطرابات النفسية التي تتسبب في تغييرات سلوكية وعاطفية تؤثر على نمط تناول الطعام للفرد. هذه الاضطرابات يمكن أن تؤثر سلبًا على الصحة العامة والوظيفة اليومية للشخص المصاب بها. وتشمل الاضطرابات الأكثر شيوعًا:

        اضطرابات الأكل النفسي (Eating Disorders): تشمل الأمراض مثل:
        
        اضطراب فرط الأكل العاطفي (Binge Eating Disorder): حيث يتناول الشخص كميات كبيرة من الطعام في فترة زمنية قصيرة بصورة متكررة دون أن يكون هناك شعور بالجوع الحقيقي.
        اضطراب الشهية (Anorexia Nervosa): يتسم بالقلق المفرط من زيادة الوزن وخوف مرضي من السمنة، مما يؤدي إلى تقليل تناول الطعام بشكل كبير وفقدان الوزن المفرط.
        اضطراب الأكل العصبي/التقيؤ (Bulimia Nervosa): يتميز بفترات من الأكل الأفراط (أكل كميات كبيرة من الطعام) يليها التقيؤ المتعمد أو استخدام المليّنات أو ممارسة التمارين الرياضية المفرطة للتخلص من السعرات الحرارية المستهلكة.
        اضطرابات التغذية المزمنة (Chronic Eating Disorders): تشمل الاضطرابات مثل:
        
        اضطراب التغذية المقهور (Avoidant/Restrictive Food Intake Disorder): يتميز بتقييد شديد في نوعية أو كمية الطعام المتناول بسبب قلق مفرط من العواقب السلبية المحتملة للأكل.
        اضطراب التغذية العصبية (Orthorexia Nervosa): يتميز بالتركيز المفرط على تناول الطعام الصحي والاهتمام المفرط بجود
        
        
        

        `,
     
     
        disease_causes:`
        تعتبر اضطرابات التغذية المرتبطة بالأمراض النفسية متعددة الأسباب وتندرج ضمن نمط تفسير متعدد العوامل. وفيما يلي بعض العوامل التي قد تساهم في حدوث هذه الاضطرابات:

        العوامل النفسية والعاطفية: الضغوط النفسية والعواطف السلبية مثل القلق، الاكتئاب، الضغط النفسي، الشعور بعدم السيطرة على الحياة، انخفاض التقدير الذاتي، الأحداث الصادمة، والتوتر العاطفي قد يؤدي إلى تطوير اضطرابات التغذية.
        
        العوامل البيئية والاجتماعية: الضغوط الثقافية والاجتماعية المتعلقة بالمظهر الجسدي والوزن، وضغوط الوسائط الاجتماعية والإعلامية التي تروج لمعايير جمال معينة، والتأثيرات السلبية للبيئة المحيطة قد تلعب دورًا في تطور اضطرابات التغذية.
        
        العوامل الجينية والوراثية: هناك بعض الدلائل على أن هناك عوامل وراثية تلعب دورًا في تفاعل الفرد مع العوامل النفسية والبيئية وتسهم في زيادة عرضة الشخص للاضطرابات التغذية.
        
        العوامل العصبية والهرمونية: هناك أبحاث تشير إلى وجود اختلالات في نظام الأنظمة العصبية والهرمونية للأشخاص المصابين ببعض اضطرابات التغذية مثل الأنوريكسيا العصبية والبليميا العصبية.
        
        تهم ملاحظة أن الأسباب المحددة قد تختلف من شخص لآخر، وعادة ما يتشابه عدة عوامل في حدوث الاضطرابات التغذية المرتبطة بالأمراض النفسية. يجب أن يتم تشخيص وعلاج هذه الاضطرابات بواسطة فريق طبي متخصص في الصحة النفسية والتغذية.
        
        
        

        `,
        
        description_Sy:`
        
        اضطرابات التغذية المرتبطة بالأمراض النفسية قد تتراوح أعراضها وتظهر بطرق مختلفة حسب نوع الاضطراب. ومع ذلك، هناك بعض الأعراض الشائعة التي قد تشمل            
        `
        ,
        Symptoms_of_the_disease:
        [
          {
          symptoms_disease:`
          فقدان الوزن بشكل كبير                      `
      },
          {
          symptoms_disease:`
          ينفي الشعور بالجوع                     `
      },
          {
          symptoms_disease:`
الامساك`

},
          {
          symptoms_disease:`
          تخطي وجبات الطعام أو تناول أجزاء صغيرة من الطعام في وجبات الطعام العادية                   `
      },
          {
          symptoms_disease:`
          فقدان الوزن بشكل كبير                      `
      },
         
  
  ]
    ,

      disease_diagnosis:`

      تشخيص اضطرابات التغذية المرتبطة بالأمراض النفسية يتطلب تقييمًا شاملاً من قبل فريق طبي متخصص، عادةً يتضمن أطباء نفسيين وأخصائيين في التغذية. العملية تشمل عادة الخطوات التالية:

      1. المقابلة السريرية: يجري الفريق المعالج مقابلة شخصية مع المريض لجمع المعلومات الشاملة عن التاريخ الصحي والأعراض والعوامل المؤثرة.
      
      2. التقييم النفسي: يستخدم الأطباء النفسيون أدوات ومقاييس لتقييم الحالة النفسية والعوامل النفسية المرتبطة بالتغذية، مثل اضطرابات المزاج والقلق والتوتر النفسي.
      
      3. التقييم الغذائي: يقوم أخصائي التغذية بتقييم نمط التغذية الحالي وتاريخ الأكل والعوامل المرتبطة بالأطعمة والوزن ومؤشر كتلة الجسم (BMI).
      
      4. التشخيص الشامل: بناءً على المعلومات المجمعة من المقابلة والتقييمات النفسية والغذائية، يتم تحديد التشخيص الدقيق لاضطراب التغذية المرتبط بالأمراض النفسية، مثل اضطراب فرط الأكل العاطفي، واضطراب الشهية، واضطراب الأكل العصبي، وغيرها.
      
      يهم ملاحظة أن تشخيص اضطرابات التغذية المرتبطة بالأمراض النفسية يتطلب خبرة وتحليل متعمق من قبل فريق طبي متخصص، ولا ينبغي أن يتم تشخيص الحالة بناءً على الأعراض فقط. يجب استشارة الفريق الطبي المختص لتقييم الحالة ووضع خطة علاج مناسبة.
        
      `,
      disease_treatment:`

      علاج اضطرابات التغذية المرتبطة بالأمراض النفسية يشمل نهجًا شاملاً يجمع بين العلاج النفسي والتغذية السليمة. إليك بعض الأساليب المشتركة في علاج هذه الاضطرابات:

      1. العلاج النفسي:
         - العلاج السلوكي المعرفي (Cognitive Behavioral Therapy، CBT): يستهدف تحدي وتغيير الأفكار والمعتقدات السلبية المتعلقة بالجسم والغذاء والصورة الذاتية.
         - العلاج العائلي: يركز على المشاركة العائلية في عملية العلاج، وتحسين الاتصال والتفاهم بين أفراد العائلة لتعزيز الدعم والتعافي.
         - العلاج النفسي الاكتشافي: يساعد المريض على استكشاف وفهم العوامل النفسية العميقة التي تساهم في اضطرابات التغذية.
      
      2. التدخل التغذوي:
         - التغذية السليمة واستعادة الوزن الصحي: يتم وضع خطة تغذية تلبي احتياجات الجسم الطبيعية وتساعد على استعادة وزن صحي.
         - التوجيه التغذوي: يتضمن تعليم المريض مفهوم الغذاء الصحي والتغذية المتوازنة وتطوير علاقة صحية مع الطعام.
      
      3. الدعم الطبي:
         - فحص طبي شامل: يتضمن تقييم الحالة الصحية العامة وفحص الوظائف الحيوية للجسم واكتشاف أي مشاكل صحية ترتبط بالاضطرابات التغذية.
         - الرعاية الدورية والمتابعة: يتطلب العلاج المستمر والمتابعة المنتظمة للتقييم والدعم الطبي والنفسي.
      
      تهم ملاحظة أن العلاج يكون مختلفًا وفقًا لنوع وشدة الاضطراب. قد يكون العلاج الاستشاري الخارجي كافي
      
      ًا في بعض الحالات، بينما يتطلب البعض الآخر العلاج الاستشاري المستشفى أو العيادة الخارجية. من المهم العمل مع فريق متخصص يشمل أخصائيين نفسيين وأخصائيين تغذية لضمان تقديم الرعاية الملائمة والشاملة.


      
      `,


      complications_of_the_disease:`

      هناك نقص عام في الفهم فيما يتعلق بخطورة OSFED وأهمية العلاج المهني لأولئك الذين يعانون من الاضطرابات التي تندرج تحت هذه الفئة. من المفاهيم الخاطئة الشائعة حول OSFED أنها ليست شديدة ، ويعتقد البعض أن الأشخاص الذين يعانون من OSFED لا يحتاجون إلى العلاج.

      يمكن أن يؤدي تأخير العلاج إلى تطوير اضطرابات متزامنة أو تفاقم شدة الاضطراب الحالي ، ويحتاج الأشخاص المصابون بـ OSFED إلى العلاج تمامًا مثل أولئك الذين يعانون من أي اضطراب أكل آخر.
      
      `,

      Medications_related_to_the_disease:
     `
     علاج نفسي او تدخل تغذوي او دعم طبي`,

Sources_and_references:[
        
{
name:`
Eating Disorders    `,
links:`
https://www.healthline.com/nutrition/common-eating-disorders      `
},



]
,Doctors:[
  {
      Name:`الدكتوره أيمان عزت`,
      Address:`المندرة , الأسكندريه`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01009078941`,
      
  },
  {
      Name:`الدكتور جمال طه محمد`,
      Address:`بني سويف`,
      img:require('../../../assets/Doc/doctor-male.jpg'),
      Phone:`01227938342`,
      
  }
]

    },
  
  
  ]);
  let nav=useNavigate();


  return <>

  <div className="container-fluid py-5">
    <div className="row delx  mx-auto">
      <div className="col-md-12 align-items-center">
        <div className="row p-2  m-auto bg-white shadow-lg rounded-5 ">
          <div className="col-lg-12 ">
            <h2 className='text-primary text-center '>{maind.disease_name}</h2>
            <div className="inge  text-center pb-4">
            <img src={maind.disease_img} className='w-75  rounded-2' alt="" />
            </div>
        <h4 className='text-black'><span className='text-primary'></span> {maind.disease_description}</h4>
        <h4 className='text-black'><span className='text-primary'>علاجه</span>: {maind.disease_detrmination}</h4>
      
          </div>
          <h2 className='text-center'>انواع الاضطراب الغذائي</h2>
          <div className="row pb-5 pt-2 justify-content-around w-100 g-2">
    {diseaseArr?.map((items )=>{
        return <div key={items.disease_id} className="col-lg-4 shadow wid  text-center" onClick={()=>{

            nav('/Details',{state:{item:items}})
                        }}>
            <span  className='w-100' >
                <h4 className='text-deis'>
                {items.disease_nameAr}
                </h4>
                </span>
        </div>
    })}
    </div>
       
        </div>

      </div>
    </div>
  </div>


  
  </>
  
}
